{
  "backend/main.mo": "Main Motoko actor for a Jewellery Order Management System that handles CRUD operations for orders, design mappings, karigars, and blob storage, including order status transitions (Pending, Ready, Hallmark, ReturnFromHallmark) and supply/return workflows.",
  "backend/migration.mo": "Migration module defining old and new actor state shapes (orders, design mappings, karigars, blobs) with a no-op `run` function since the schema is unchanged.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (RB order supply dialog, order splitting, partial supply, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing the purpose and recent changes of every component, page, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "HTML shell for the React SPA titled 'Jewellery Order Management System' that mounts the app into a `#root` div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (Dashboard, IngestOrders, MasterDesigns, KarigarDetail, AgeingStock, etc.), wraps the app in QueryClient and ThemeProvider, and renders the sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that displays CO-type orders with Pending status, with a search input filtering by order number, design code, or generic name.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "A modal dialog component that displays a zoomable and pannable design image fetched by design code, with support for mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "A dashboard tab that lists orders in Hallmark status with filtering by type, karigar, date range, and search text, supporting bulk status updates and Excel export.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "A dashboard tab that groups pending orders by karigar and displays summary cards with total orders and weight, linking to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "A reusable table component for displaying orders with support for bulk selection, marking orders as ready, deletion, and exporting to Excel/PDF/JPEG formats.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "A dashboard tab showing ready orders with search, bulk selection, deletion, and the ability to return selected orders back to Pending status with fresh backend data reconciliation.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "A set of summary metric cards (total orders, weight, quantity, customer orders) that filter displayed data based on the currently active dashboard tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component that steps through a list of orders one-by-one, letting the user enter a supplied quantity for each RB order and calling `batchSupplyRBOrders` on the backend actor, with validation and split-order toast feedback.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "A dashboard tab that displays all Pending/ReturnFromHallmark orders grouped by design code, supporting search, type/karigar filtering, bulk selection, mark-as-ready (with RB supply dialog), and delete actions.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "An alert banner that fetches unmapped orders and displays design codes missing generic or karigar name mappings, with navigation buttons to the unmapped-codes and master-designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "The application sidebar component that renders navigation links for all major routes and includes a Data Reset menu item that opens the DataResetDialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "A confirmation alert dialog that triggers the `useResetActiveOrders` mutation to permanently delete all Pending, Ready, and ReturnFromHallmark orders.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "A dialog for editing a design's karigar assignment, supporting selection from existing karigars or adding a new one, and saving via provided `onSave`/`onAddKarigar` callbacks.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "An empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including orders, karigars, master designs, and reconciliation records via an actor interface.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including gold, sidebar, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AgeingStock.tsx": "Page component that displays pending orders grouped by design code with age-band color coding (green/yellow/red), supporting bulk mark-as-ready actions and a supplied quantity dialog.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component that supports scanning order barcodes via hardware scanner or camera, accumulating scanned order IDs and batch-updating their status through a mutation hook.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders summary cards and a tabbed interface for viewing total orders, ready orders, hallmark, customer orders, and karigars sections.",
  "frontend/src/pages/DesignImages.tsx": "Page component for uploading design images to the backend, supporting both folder selection and ZIP file extraction, processing images in batches and mapping filenames to design codes.",
  "frontend/src/pages/IngestOrders.tsx": "Page component for uploading orders from an Excel file, parsing them, and batch-submitting them to the backend actor with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Page component displaying pending orders for a specific karigar, with support for exporting orders as PDF/JPEG/Excel and marking selected orders as ready.",
  "frontend/src/pages/MasterDesigns.tsx": "Page component for uploading and managing master design Excel mappings (design code, generic name, karigar), including editing individual mappings and assigning orders to karigars.",
  "frontend/src/pages/Reconciliation.tsx": "Page component for reconciling a master Excel file against backend orders, displaying matched/unmatched results and allowing the user to persist selected reconciled rows.",
  "frontend/src/pages/TagPrinting.tsx": "A page component that displays ready orders grouped by design code for tag printing, supporting date range filtering, bulk selection, clipboard copying of order numbers, and a hallmark status update dialog.",
  "frontend/src/pages/UnmappedCodes.tsx": "A page component that lists orders missing generic name or karigar mappings, grouped by design code, and allows inline editing to update or reassign those mappings.",
  "frontend/src/utils/excelParser.ts": "Utility module for parsing Excel files into order data, handling Indian-locale DD/MM/YYYY date strings, Excel serial date conversion, and extracting/normalizing design codes, numbers, and strings from raw rows.",
  "frontend/src/utils/exportUtils.ts": "Utility module providing functions to export order data to Excel (via SheetJS) and to a PDF (grouped by design code with embedded images fetched from the backend actor), with mobile/iOS detection helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom container sizes, extended color tokens (using OKLCH CSS variables), typography/container-queries/animate plugins, and custom font families.",
  "project_state.json": "Tracks the project state (version 3) for an order management system with Regional Buffer (RB) order handling, documenting architectural notes, known issues, existing features, and requirements for partial-split RB order logic."
}