{
  "backend/main.mo": "Main Motoko actor for a Jewellery Order Management System that manages orders, design mappings, karigars, and blob storage, exposing functions to save, ingest, supply, and query orders with status tracking. Applies data migration on upgrade and computes order summaries.",
  "backend/migration.mo": "Migration module that transforms the old Order type (with `weight` field) to the new Order type (with `weightPerUnit` field) by mapping each order in the stored Map during canister upgrade.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: fixing total weight calculation to use qty×weightPerUnit across all dashboard tabs, and fixing summary cards to correctly reflect reduced totals after partial order splits.",
  "frontend-file-summaries.txt": "Text file containing a JSON object with one-sentence summaries of each frontend source file, describing component responsibilities and notable bug fixes applied across the dashboard, pages, and utilities.",
  "frontend/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, chart, and destructive colors.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System that mounts the React app into a `#root` div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all page routes (including a karigar detail route), wraps the app in ThemeProvider and QueryClientProvider, and renders the sidebar layout with a Toaster.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that filters and displays only CO-type Pending orders from the backend, with a search input filtering by order number, design code, or generic name.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "A modal dialog component that displays a zoomable and pannable design image fetched by design code, with support for both mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "A dashboard tab showing orders in Hallmark status with filtering by order type, karigar, date range, and search text, plus bulk status update and Excel export functionality.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "A dashboard tab that groups pending orders by karigar and displays summary cards (order count, total weight) with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "A reusable table component for displaying orders with support for bulk selection, marking orders as ready, deletion, and multi-format export (Excel, PDF, JPEG).",
  "frontend/src/components/dashboard/ReadyTab.tsx": "A dashboard tab listing ready orders with search, bulk selection, batch delete, and batch return-to-pending functionality.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "A set of four summary metric cards (total orders, weight, quantity, customer orders) that display context-aware statistics based on the currently active dashboard tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component that steps through a list of RB orders one at a time, prompting the user to enter a supplied quantity and calling `batchSupplyRBOrders` to mark orders as ready or split them, then invalidates relevant React Query caches on completion.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Dashboard tab that displays filtered Pending/ReturnFromHallmark orders with search and filter controls, handling mark-as-ready logic by routing RB orders through `SuppliedQtyDialog` and non-RB orders directly through a mutation.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Displays an alert banner listing design codes that are missing generic name or karigar name mappings, grouped by design code, with navigation buttons to the unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Application sidebar component that renders navigation links for all main routes and includes a Data Reset button that opens a confirmation dialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "Confirmation alert dialog that permanently deletes all active (Pending, Ready, ReturnFromHallmark) orders by calling the `useResetActiveOrders` mutation when confirmed.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing a design's karigar assignment, supporting selection from existing karigars or adding a new one inline, and saving the updated mapping via provided async callbacks.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated actor (when an Internet Identity is present) or an anonymous one, and invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data fetching and mutations, including orders, karigars, design mappings, and blob/image operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark themes, including gold accent colors and interactive element styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component that supports both hardware barcode scanner input and camera-based QR scanning to collect order IDs and batch-update their statuses.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying summary cards and tabbed views for total orders, ready orders, hallmark, customer orders, and karigars.",
  "frontend/src/pages/DesignImages.tsx": "Page for uploading design images to the backend either from a folder or a ZIP archive, processing them in batches and reporting per-file upload results.",
  "frontend/src/pages/IngestOrders.tsx": "Page for uploading an Excel file of orders, parsing them, and batch-saving them to the backend canister with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page for a specific karigar showing their pending orders, with support for exporting (PDF/JPEG/Excel) and marking orders as ready, including a supplied-quantity dialog for RB-type orders.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading a Master Design Excel file that parses design-to-karigar mappings, stores them on the backend, and displays an editable table of all design mappings.",
  "frontend/src/pages/TagPrinting.tsx": "Page that displays ready orders grouped by design code with date-range filtering, clipboard copy of order numbers, and bulk status updates to mark selected designs as hallmarked.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page that lists orders with missing design mappings (no generic name or karigar), allowing inline editing to assign or reassign the missing fields.",
  "frontend/src/utils/excelParser.ts": "Parses an Excel file of orders using SheetJS, validates required fields, normalizes design codes, and returns typed order data with row-level errors.",
  "frontend/src/utils/exportUtils.ts": "Exports order data to Excel (via SheetJS) or a grouped-by-design PDF with embedded design images fetched from a backend actor, with mobile/iOS handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch variables), typography, container queries, animation plugins, and extended font/radius/chart settings.",
  "project_state.json": "Tracks the current project state, known bugs (total weight calculation and summary card update on partial splits), and existing fix-feature requests for an order management app."
}