{
  "backend/main.mo": "Main Motoko actor for a Jewellery Order Management System that manages orders, design mappings, karigars, and blob storage with operations for creating, supplying, returning, and status-updating orders.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, test IDs, and confidence levels, covering RB order partial-supply recalculation, return-to-pending restoration, and row consolidation logic.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role and recent changes, serving as a build/documentation reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Jewellery Order Management System' that mounts the app at `#root` and loads `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes, wraps the app in QueryClient, ThemeProvider, and SidebarProvider, and renders the shared layout with AppSidebar.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that fetches all orders and displays only CO-type Pending orders, with a search input filtering by order number, design code, or generic name.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "A modal dialog component that displays a zoomable and pannable design image fetched by design code, with support for mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "A dashboard tab showing orders in Hallmark status with filtering by type, karigar, date range, and search text, plus bulk status update and Excel export functionality.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "A dashboard tab that groups pending orders by karigar name into cards showing order count and total weight, with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "A reusable order table component supporting bulk selection, mark-as-ready actions, delete, and multi-format export (Excel, PDF, JPEG), with a design image modal on design code click.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "A dashboard tab displaying ready orders grouped by order number with search, bulk selection, and a return-to-pending action that computes total quantities before calling the backend mutation.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Renders summary metric cards (total orders, weight, quantity, customer orders) for the active dashboard tab, with deduplication logic for RB orders and partial-supply exclusion.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component that allows users to enter supplied quantities for Regional Buffer (RB) orders, validates input against ordered quantities, and submits a batch supply mutation on confirmation.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "A dashboard tab that displays pending orders grouped by design code, consolidates RB order fragments into single rows, and supports bulk mark-as-ready or supply actions with search and selection.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "An alert section that fetches and displays unmapped design codes (missing generic or karigar names), grouped by design, with navigation buttons to resolve them.",
  "frontend/src/components/layout/AppSidebar.tsx": "The application sidebar component that renders navigation menu items with active-state highlighting and includes a data reset dialog trigger.",
  "frontend/src/components/layout/DataResetDialog.tsx": "A confirmation alert dialog that permanently deletes all active (Pending, Ready, Return from Hallmark) orders via a reset mutation with success/error toast feedback.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "A modal dialog for editing a design's karigar assignment, supporting selection from existing karigars or adding a new one, and saving the updated mapping with toast notifications.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "An empty file with no content or implementation.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an AuthClient wrapper.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching and mutating backend data including orders, karigars, master designs, and reconciliation records.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AgeingStock.tsx": "Page component that displays pending orders grouped by design code with age-band color coding (green/yellow/red) and supports bulk marking orders as ready.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component that supports scanning order barcodes via hardware scanner or camera, collecting scanned IDs and batch-updating their status.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders summary cards and tabbed views for total orders, ready, hallmark, customer orders, and karigars sections.",
  "frontend/src/pages/DesignImages.tsx": "Page component for uploading design images to the backend, supporting both folder selection and ZIP file extraction, processing images in batches and mapping filenames to design codes.",
  "frontend/src/pages/IngestOrders.tsx": "Page component for uploading orders from an Excel file, parsing them, and saving them to the backend in batches of 50 with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Page component displaying pending orders for a specific karigar, with support for exporting orders as PDF/JPEG/Excel and marking orders as ready, including a dialog for RB-type orders.",
  "frontend/src/pages/MasterDesigns.tsx": "Page component for uploading and managing master design mappings from an Excel file, displaying a table of design-to-karigar mappings with editing capabilities.",
  "frontend/src/pages/Reconciliation.tsx": "Page component for reconciling a master Excel file against existing orders, parsing the file, displaying matched/unmatched results in a table, and persisting selected reconciled rows to the backend.",
  "frontend/src/pages/TagPrinting.tsx": "A page component that displays ready orders grouped by design code for tag printing, supporting date range filtering, bulk selection, clipboard copying of order numbers, and a hallmark status update dialog.",
  "frontend/src/pages/UnmappedCodes.tsx": "A page component that lists orders missing generic name or karigar mappings, grouped by design code, with inline editing to update or reassign design mappings.",
  "frontend/src/utils/excelParser.ts": "Utility module for parsing Excel order files, providing helpers to normalize design codes, extract strings/numbers, and convert Excel serial dates or DD/MM/YYYY strings to epoch milliseconds.",
  "frontend/src/utils/exportUtils.ts": "Utility module for exporting order data to Excel (via SheetJS) or PDF (via dynamically generated HTML with embedded design images fetched from the backend actor), with mobile/iOS detection helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom container sizes, extended color tokens (using OKLCH CSS variables), font families, border radii, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 3) for an order management system with SO/CO/RB order types, documenting existing features, known issues around RB partial supply flow, summary card recalculation, and mandatory row consolidation logic."
}