{
  "backend/main.mo": "Main Motoko actor for the Jewellery Order Management System defining order, design mapping, and karigar data types with CRUD operations including save, supply, return, hallmark status updates, and blob storage mixin for design images and master Excel files.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, affected files, component dependencies, and test IDs covering date parsing fixes, search bar enhancements, row selection, mark-ready buttons, and other dashboard improvements.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the purpose and key changes of each component, page, hook, and utility in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.) used throughout the UI.",
  "frontend/index.html": "HTML entry point for the React app titled 'Jewellery Order Management System' that mounts the app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all application routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail, reconciliation, and ageing stock), wraps the app in QueryClient, ThemeProvider, and SidebarProvider.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that displays CO-type orders with Pending status, featuring a case-insensitive search bar filtering by order number, design code, or generic name.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "A modal dialog component that displays a zoomable and pannable design image fetched by design code, with support for mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "A dashboard tab showing orders in Hallmark status with filtering by order type, karigar, date range, and search text, plus bulk status update and Excel export functionality.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "A dashboard tab that groups pending orders by karigar and displays summary cards with total orders and weight, linking to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "A reusable order table component supporting bulk selection, mark-as-ready actions, deletion, and multi-format export (Excel, PDF, JPEG) with a design image modal on row click.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "A dashboard tab listing ready orders with search, bulk selection, delete, and return-to-pending functionality, handling partial RB order restoration logic.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "A set of summary stat cards (total orders, weight, quantity, customer orders) that filter displayed metrics based on the currently active dashboard tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component that steps through a list of RB orders one at a time, prompting the user to enter a supplied quantity for each, then calls `batchSupplyRBOrders` to mark them ready or split them if partially supplied.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "A dashboard tab that displays all orders grouped by design code with filtering, search, and bulk-selection support, and allows marking RB orders as ready (with optional quantity splitting) or deleting orders.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Displays an alert banner listing design codes that are missing generic name or karigar name mappings, with navigation buttons to the unmapped-codes and master-designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the application's collapsible sidebar with navigation links to all major pages and a Data Reset action that opens a confirmation dialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "An alert dialog that confirms and executes deletion of all active (Pending, Ready, Return from Hallmark) orders via the `useResetActiveOrders` mutation.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "A dialog for updating the karigar assignment of a design code, supporting selection from existing karigars or inline addition of a new one, then saving via a provided `onSave` callback.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "An empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including orders, karigars, master designs, and reconciliation records via the canister actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including gold, sidebar, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AgeingStock.tsx": "Page component that displays pending orders grouped by design code with age-band color coding (green/yellow/red), supporting bulk mark-as-ready actions and a supplied quantity dialog.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component supporting both hardware barcode scanner input and camera-based QR scanning to collect order IDs and batch-update their status.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders summary cards and a tabbed interface for viewing total orders, ready orders, hallmark, customer orders, and karigars sections.",
  "frontend/src/pages/DesignImages.tsx": "Page component for uploading design images to the backend, supporting both folder selection and ZIP file extraction, processing images in batches and mapping filenames to design codes.",
  "frontend/src/pages/IngestOrders.tsx": "Page component for uploading orders from an Excel file, parsing them, and submitting them in batches to the backend actor with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Page component displaying pending orders for a specific karigar, with support for exporting orders as PDF/JPEG/Excel and marking selected orders as ready.",
  "frontend/src/pages/MasterDesigns.tsx": "Page component for uploading and managing master design Excel mappings (design code, generic name, karigar), including editing individual mappings and assigning orders to karigars.",
  "frontend/src/pages/Reconciliation.tsx": "Page component for reconciling a master data Excel file against existing orders, displaying matched/unmatched results and allowing the user to persist selected reconciled rows.",
  "frontend/src/pages/TagPrinting.tsx": "A page that displays ready orders grouped by design code for tag printing, supporting date range filtering, bulk selection, clipboard copying of order numbers, and a hallmark status update dialog.",
  "frontend/src/pages/UnmappedCodes.tsx": "A page that lists design codes with missing generic name or karigar mappings, allowing inline editing to update or reassign those mappings via mutation hooks.",
  "frontend/src/utils/excelParser.ts": "Utility functions for parsing Excel order data, including normalization of design codes, extraction of numeric/string/date fields, and handling of both Excel serial dates and DD/MM/YYYY string formats for Indian locale files.",
  "frontend/src/utils/exportUtils.ts": "Utility functions to export order data to Excel (via SheetJS) or PDF (via dynamically generated HTML with embedded design images fetched from the backend actor), with mobile/iOS detection for download handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom container sizes, extended color tokens using OKLCH CSS variables (including gold and sidebar palettes), custom font families, border radius, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state version 3 for a dashboard management app with order tracking, documenting known issues (date format bug), existing features, and planned enhancements including date parsing fixes, search, row selection, and Mark Ready functionality."
}