{
  "backend/main.mo": "Main Motoko actor for a jewellery order management system that handles order creation, supply, hallmark tracking, design mappings, karigar management, and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report linking the order quantity loading fix to specific frontend files, hooks, and components with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing their purpose, imports, and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the Jewellery Order Management System SPA that mounts the React app at the root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, QueryClient, ThemeProvider, SidebarProvider, and global Toaster.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that filters and displays pending CO-type orders with a search input and an OrderTable supporting mark-ready, delete, and export actions.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog that fetches and displays a design image by code with zoom controls, and shows associated generic name and karigar metadata.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Dashboard tab for displaying and managing orders in Hallmark or ReturnFromHallmark status, supporting search, bulk status updates to 'Return from Hallmark', and Excel export.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Dashboard tab that groups pending orders by karigar (artisan) and displays summary cards with order count, total quantity, and unique designs, linking to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with optional checkboxes, mark-ready, delete, and export actions, including support for ageing tiers and a supplied-quantity dialog for RB order types.",
  "frontend/src/components/dashboard/OverdueFilterControl.tsx": "Popover UI control for sorting orders by age (most overdue or most recent first) and filtering by overdue threshold (3, 7, or 15 days), with an active-state indicator and clear option.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Dashboard tab for ready orders with search, bulk delete, and bulk return-to-pending functionality, grouping selected orders by order number and summing quantities before calling the return mutation.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays a row of four stat cards (Orders, Total Qty, Designs, Karigars) filtered by the active dashboard tab, with loading skeleton and error states.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component that steps through a list of RB orders one at a time, collecting a supplied quantity for each, then submits them all via a batch mutation when the last order is processed or on cancel.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "A dashboard tab that displays pending orders enriched with karigar/generic name mappings, supporting filtering by type, karigar, search text, and overdue thresholds with sort options.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Renders a destructive alert listing design codes that have no karigar or generic name mapping, grouped by design code with order counts.",
  "frontend/src/components/layout/AppSidebar.tsx": "The application sidebar with navigation links to all major routes and a Data Reset action that opens a confirmation dialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "A confirmation alert dialog that permanently deletes all active (Pending, Ready, Return from Hallmark) orders via a reset mutation when confirmed.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "A modal dialog for updating the karigar assignment of a design code, supporting selection from existing karigars or inline addition of a new one.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "An empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Computer Internet Identity authentication, managing login/logout state and persisting identity across page reloads using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including orders, karigars, design mappings, and images, with timeout handling and cache invalidation.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark themes including gold accents, along with base interactive element styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component for scanning order barcodes via hardware scanner or camera, collecting scanned order IDs and batch-updating their status in the backend.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches all orders and displays them across tabbed views (Total, Ready, Hallmark, Customer, Karigars) with summary cards and error/retry handling.",
  "frontend/src/pages/DesignImages.tsx": "Page component for uploading design images to the backend, supporting both folder selection and ZIP file extraction, processing images in batches and mapping filenames to design codes.",
  "frontend/src/pages/IngestOrders.tsx": "Page component for uploading orders from an Excel file, parsing them, and saving them to the backend in batches of 50 with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Page component displaying pending orders for a specific karigar (artisan), with filtering/sorting by overdue age, ageing tier highlighting, and export options to PDF, JPEG, and Excel.",
  "frontend/src/pages/MasterDesigns.tsx": "Page component for managing master design mappings, allowing Excel upload, search/filter, editing individual mappings, adding karigars, and clearing all mappings.",
  "frontend/src/pages/TagPrinting.tsx": "Page component for fetching ready orders within a date range, grouping them by design code, and marking selected design groups as Hallmark status.",
  "frontend/src/pages/UnmappedCodes.tsx": "React page that displays design codes from orders that lack a master design mapping, allowing users to assign a generic name and karigar to each unmapped code via a dialog.",
  "frontend/src/utils/ageingUtils.ts": "Utility functions to calculate how many days a pending order has been waiting and to assign color-coded ageing tiers (oldest/middle/newest) within each design code group.",
  "frontend/src/utils/excelParser.ts": "Parses an uploaded Excel file into order records using SheetJS, validates required fields, normalizes design codes to uppercase, and returns parsed data alongside row-level errors.",
  "frontend/src/utils/exportUtils.ts": "Provides functions to export order arrays to Excel (via SheetJS) or PDF (via a print window), with additional helpers for karigar-specific and design-specific exports.",
  "frontend/src/utils/orderNormalizer.ts": "Normalizes Order objects from the backend by coercing the quantity field to BigInt, and provides a helper to safely convert BigInt quantities to numbers for display.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom fonts (Inter, Playfair Display), an extended OKLCH-based color palette (including gold and sidebar tokens), and border radius variables.",
  "project_state.json": "Project state metadata file tracking version, known issues (quantities not loading), and the single existing feature request to investigate and fix order quantity display across dashboard components."
}