{
  "backend/main.mo": "Main Motoko actor for a jewellery order management system that handles order CRUD, design mappings, karigar management, hallmark workflows, and blob storage for design images and Excel files.",
  "feature_evidence.json": "Feature evidence report confirming that TotalOrdersTab.tsx implements within-group overdue sorting of Pending/ReturnFromHallmark orders by descending overdue days (oldest orderDate first, nulls last).",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key changes in each component, page, and hook file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point via a module script.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (including the new `/ageing-stock` route), QueryClient, ThemeProvider, and the shared sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that filters and displays CO-type Pending orders with a search input supporting order number, design code, and generic name filtering.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for viewing a design's image with zoom and pan (mouse and touch) controls, fetching the image via `useGetDesignImage`.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Dashboard tab displaying orders with Hallmark status, supporting filtering by order type, karigar, date range, and search text, with bulk selection and export-to-Excel functionality.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Dashboard tab that groups pending orders by karigar name into cards showing total orders and weight, with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with optional bulk selection, mark-as-ready actions (handling RB vs SO/CO order types differently), delete, and multi-format export capabilities.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Dashboard tab for Ready-status orders with search, bulk selection, delete, and return-to-pending functionality that handles partial RB order merge logic.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays summary metric cards (total orders, weight, quantity, customer orders) filtered according to the currently active dashboard tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog that steps through a list of RB orders one at a time, prompting the user to enter a supplied quantity and calling batchSupplyRBOrders to split or fully fulfill each order.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Dashboard tab that displays all Pending and ReturnFromHallmark orders with filtering by order type, karigar, and search text, sorted by overdue days within design code groups. Also handles marking orders as ready and supplying quantities via a dialog.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Alert banner that groups and displays orders with unmapped design codes (missing generic or karigar name), showing up to 5 groups with navigation buttons to the unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Application sidebar with navigation links to all major routes and a Data Reset action that opens a confirmation dialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "Confirmation dialog that permanently deletes all active (Pending, Ready, ReturnFromHallmark) orders via the resetActiveOrders mutation, with success/error toast feedback.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for updating the karigar assignment of a design code mapping, with support for adding a new karigar inline and saving changes that reassign pending orders.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating and refetching dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout state, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders, karigars, design mappings, and master data via the backend actor. Includes queries for filtered orders, reconciliation, and mutations for status updates and data persistence.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS that defines CSS custom properties for light/dark themes (colors, sidebar, charts) using OKLCH color space, plus base styles for transitions, hover/focus/disabled states.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/src/pages/AgeingStock.tsx": "Page component that displays pending orders grouped by design code with color-coded age bands (green/yellow/red) based on days since order date, supporting bulk mark-as-ready actions.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component supporting both hardware barcode scanner (keyboard input) and camera-based QR scanning to collect order IDs and batch-update their status in the backend.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with summary cards and tabbed views for Total Orders, Ready, Hallmark, Customer Orders, and Karigars, plus an unmapped orders section.",
  "frontend/src/pages/DesignImages.tsx": "Page for uploading design images to the backend either from a folder or a ZIP archive, processing files in batches and reporting per-file upload results.",
  "frontend/src/pages/IngestOrders.tsx": "Page for uploading an Excel file of orders, parsing them, and batch-submitting them to the backend actor with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page for a specific karigar showing their pending orders, with support for exporting (PDF/JPEG/Excel) and marking orders as ready, including a dialog for RB order supply quantities.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading a Master Design Excel file to extract design-to-karigar mappings, persist them to the backend, and display/edit the resulting mapping table.",
  "frontend/src/pages/Reconciliation.tsx": "Page for uploading a master reconciliation file, parsing it into MasterDataRow records, running a reconciliation mutation, and selectively persisting matched/unmatched results.",
  "frontend/src/pages/TagPrinting.tsx": "Page displaying ready orders grouped by design code with date-range filtering, clipboard copy of order numbers, and bulk hallmark status updates for selected design groups.",
  "frontend/src/pages/UnmappedCodes.tsx": "React page that displays orders with missing design mappings (generic name or karigar), grouped by design code, and allows inline editing to assign or update those mappings via mutation hooks.",
  "frontend/src/utils/excelParser.ts": "Utility that parses an uploaded Excel file using SheetJS, extracting order fields (order number, type, design, weight, date, etc.) with helpers for normalizing design codes, extracting numbers/strings, and handling Excel serial dates.",
  "frontend/src/utils/exportUtils.ts": "Utility providing exportToExcel (SheetJS-based) and exportToPDF (HTML-based with embedded design images fetched from an actor) functions for exporting order data, with mobile/iOS detection for download handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom fonts (Inter, Playfair Display), OKLCH-based color tokens (primary, gold, sidebar, chart, etc.), border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking the app's current version, architectural notes, known issues (ageing stock date parsing, RB return validation, merge-back logic), existing features, and five pending fix/feature requests (AR-1 through AR-5)."
}