{
  "backend/main.mo": "Motoko actor defining the backend for a Jewellery Order Management System, including order CRUD, supply/return flows, design mappings, karigar management, and blob storage for design images and master Excel files.",
  "feature_evidence.json": "Feature evidence report confirming that the ReadyTab.tsx return-to-pending flow was updated to call the fixed backend batch return function and display success/error toasts.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, dashboard tab components, hooks, and utilities for the jewellery order management frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system including colors, borders, sidebar, and chart tokens.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module for the Jewellery Order Management System.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in QueryClient, ThemeProvider, and renders the sidebar layout with a Toaster.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab that displays CO-type orders with Pending status, supporting text search by order number, design code, or generic name.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for viewing a design image with zoom and pan support, fetching the image via the useGetDesignImage hook and handling loading/error states.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Dashboard tab displaying orders with Hallmark status, supporting filtering by order type, karigar, date range, and search text, with bulk selection and batch status update (return from hallmark) and Excel export functionality.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Dashboard tab that groups pending orders by karigar name into cards showing total orders and weight, with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable order table component with optional bulk selection, mark-as-ready actions (handling RB vs SO/CO order types differently), delete, and multi-format export (Excel, PDF, JPEG) capabilities.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Dashboard tab for orders in Ready status with search filtering, bulk selection, and batch delete or return-to-pending operations grouped by order number.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary metric cards (total orders, weight, quantity, customer orders) filtered according to the currently active dashboard tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog that steps through a list of RB orders one at a time, prompting the user to enter a supplied quantity and calling batchSupplyRBOrders to mark each order as ready or split it into partial quantities.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Dashboard tab that displays and filters Pending/ReturnFromHallmark orders by type, karigar, and search text, with support for marking orders as ready and opening a supply dialog for RB-type orders.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Alert banner that groups and displays orders with unmapped design codes (missing generic or karigar name), with navigation buttons to the unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Application sidebar with navigation links to all main routes and a data reset action that opens a confirmation dialog.",
  "frontend/src/components/layout/DataResetDialog.tsx": "Confirmation dialog that permanently deletes all active (Pending, Ready, ReturnFromHallmark) orders via the resetActiveOrders mutation.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for updating the karigar assignment of a design code, with support for selecting an existing karigar or adding a new one inline.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status derived from the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including orders, karigars, master designs, and design mappings using the ICP actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light/dark themes including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component supporting both hardware barcode scanner and camera-based QR scanning to collect order IDs and batch-update their statuses.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying summary cards and tabbed views for total orders, ready orders, hallmark, customer orders, and karigars.",
  "frontend/src/pages/DesignImages.tsx": "Page for uploading design images to the backend either from a folder or a ZIP file, processing them in batches and reporting upload results.",
  "frontend/src/pages/IngestOrders.tsx": "Page for parsing an Excel file of orders and uploading them to the backend in batches, tracking progress and reporting success/failure per row.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page for a specific karigar showing their pending orders with support for marking orders as ready, handling RB order supply quantities, and exporting orders to PDF, JPEG, or Excel formats.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading and managing master design Excel files, mapping design codes to generic names and karigars, and reassigning or editing design-to-karigar mappings.",
  "frontend/src/pages/TagPrinting.tsx": "Page displaying ready orders grouped by design code with date range filtering, clipboard copy of order numbers, and bulk hallmark status updates for selected design groups.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page that identifies and lists orders with missing design mappings (generic name or karigar), allowing inline editing to assign or reassign the missing fields.",
  "frontend/src/utils/excelParser.ts": "Utility that parses order Excel files using SheetJS, normalizes design codes to uppercase, validates required fields, and returns structured order data with per-row error reporting.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export order data to Excel (via SheetJS) and PDF (via dynamically loaded jsPDF), including fetching and embedding design images grouped and sorted by design code, with mobile/iOS-specific download handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch CSS variables), typography, container queries, animation plugins, and extended font families and border radii.",
  "project_state.json": "Tracks the current state of the Jewellery Order Manager project, documenting architectural notes, known issues (Return to Pending failing for RB orders), existing features, and pending fix requests for the backend return-to-pending logic."
}