{
  "kind": "build_request",
  "title": "Fix RB partial supply calculation and consolidation logic",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When an RB order is partially marked as Ready via the supplied quantity popup, the Total Orders summary card must immediately recalculate: decrement Total Orders count by 1 and display a '1 RB Pending' indicator, reduce Total Qty by the supplied quantity, reduce Total Weight by the corresponding supplied weight, and leave Customer Order count unchanged. This recalculation must happen at the data and state level only with no UI, workflow, or structural changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Reduce Total Orders by 1 (show 1 RB Pending indicator)",
          "Reduce Total Qty by supplied qty",
          "Reduce Total Weight by supplied weight",
          "Keep Customer Order count unchanged"
        ]
      },
      "acceptanceCriteria": [
        "After confirming a partial RB supply, the Total Orders count in the summary card decreases by exactly 1.",
        "A '1 RB Pending' indicator appears on the Total Orders summary card after partial RB supply.",
        "Total Qty in the summary card decreases by exactly the supplied quantity entered in the popup.",
        "Total Weight in the summary card decreases by exactly the weight corresponding to the supplied quantity.",
        "Customer Order count in the summary card remains unchanged after a partial RB supply."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When a partially supplied RB order is marked Return to Pending from the Ready tab, the Total Orders summary card totals must fully restore to their pre-supply original values: Total Orders count increases back by 1, Total Qty increases by the previously supplied quantity, Total Weight increases by the previously supplied weight, and Customer Order count remains unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "When a partially supplied RB is marked Return to Pending, totals must fully restore to original values."
        ]
      },
      "acceptanceCriteria": [
        "After Return to Pending, Total Orders count in the summary card is restored to the value before the partial supply.",
        "After Return to Pending, Total Qty is restored to the value before the partial supply.",
        "After Return to Pending, Total Weight is restored to the value before the partial supply.",
        "Customer Order count remains unchanged throughout the return-to-pending flow."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement mandatory RB row consolidation logic: when a partially supplied RB order is returned to Pending, the remaining pending fragment and any other pending fragments of the same logical RB order must automatically merge into a single consolidated row with combined quantity and weight before being displayed or before any further Mark as Ready action is allowed. The supplied quantity popup must appear only once per logical RB order, not separately for each split fragment. No UI, structural, or workflow changes are permitted - only the data consolidation and merge logic must change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Consolidation is missing. When partial RB is returned to pending, it must merge back into ONE single row with combined qty and weight.",
          "The system must always treat RB as one logical order. Split fragments must auto-merge before any further Mark as Ready action.",
          "Supplied qty popup must appear only once per logical RB order."
        ]
      },
      "acceptanceCriteria": [
        "After Return to Pending, all split fragments of the same logical RB order are merged into a single row in the pending list.",
        "The merged row shows the sum of quantities and weights of all merged fragments.",
        "The supplied quantity popup appears only once for a logical RB order, not once per split fragment.",
        "Before any Mark as Ready action for an RB order, split fragments are auto-merged into one consolidated row.",
        "No duplicate RB rows for the same logical order exist in the pending list at any time."
      ]
    }
  ],
  "constraints": [
    "Do not change any UI components, layouts, or visual elements.",
    "Do not change any workflows, user flows, or navigation structure.",
    "Do not change any features, tabs, dialogs, or functional behaviors beyond the three calculation and consolidation bugs described.",
    "Do not alter backend data model or status transition logic unless strictly required to support correct consolidation.",
    "Changes must be limited to calculation logic in summary card derivation and RB row consolidation and merge logic only."
  ],
  "nonGoals": [
    "Redesigning or restyling any UI components.",
    "Changing the supplied quantity popup UI or workflow.",
    "Modifying SO or CO order type logic.",
    "Adding new features or tabs.",
    "Changing how orders are ingested or exported."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}