{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix quantities not loading on dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Investigate and fix the issue where order quantities fail to load on the dashboard, ensuring quantity values are correctly fetched from the backend, passed through React Query hooks, and rendered in all relevant components including SummaryCards, TotalOrdersTab, OrderTable, and any other components that display qty fields",
      "acceptanceCriteria": [
        "Quantity values are visible and non-zero (when data exists) in the SummaryCards summary metric for quantity.",
        "Quantity columns/fields in OrderTable and TotalOrdersTab display correct values after page load.",
        "The backend query for orders returns qty fields populated correctly.",
        "React Query hooks in useQueries.ts correctly map and expose qty data from the backend response.",
        "No console errors related to undefined or null qty fields."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the React Query hooks that fetch orders from the backend. Ensure that the quantity field from the backend response (which uses 'quantity' as bigint per backend.d.ts) is correctly extracted and exposed in the query results. Verify that all order-fetching queries (useOrders, useOrdersQuery, useReadyOrders, etc.) properly map the 'quantity' field from the backend Order type. Add console logging during development to verify quantity values are being received from the backend actor."
        },
        {
          "path": "frontend/src/components/dashboard/SummaryCards.tsx",
          "operation": "modify",
          "description": "Fix the quantity calculation in the summary cards component. Ensure the component correctly accesses the 'quantity' field from each order object (which is a bigint from the backend). Convert bigint to number if needed for display using Number() or similar conversion. Verify that the reduce operation or aggregation logic properly sums quantity values. Add null/undefined checks to prevent runtime errors when quantity is missing."
        },
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Fix the quantity column rendering in the OrderTable component. Ensure the table column definition correctly references the 'quantity' property from order objects. Handle bigint-to-number conversion for display purposes (e.g., using Number() or .toString()). Add proper null/undefined handling for the quantity field. Verify that sorting by quantity works correctly if implemented."
        },
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Review and fix any quantity-related logic in the TotalOrdersTab component. Ensure that the OrderTable component receives orders with intact quantity values. Verify that any filtering or transformation logic preserves the quantity field. Check that the SuppliedQtyDialog correctly handles quantity values when marking RB orders as ready."
        },
        {
          "path": "frontend/src/components/dashboard/CustomerOrdersTab.tsx",
          "operation": "modify",
          "description": "Review the CustomerOrdersTab component to ensure quantity values are correctly passed to the OrderTable. Verify that the filtered orders preserve the quantity field when applying search filters by order number, design code, or generic name."
        },
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "Verify that the ReadyTab component correctly passes quantity values from the ready orders query to the OrderTable component. Ensure that batch operations (delete, return to pending) don't interfere with quantity display."
        },
        {
          "path": "frontend/src/components/dashboard/HallmarkTab.tsx",
          "operation": "modify",
          "description": "Review the HallmarkTab component to ensure quantity values are preserved when filtering orders by type, karigar, date range, and search text. Verify that Excel export includes quantity values correctly."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Review the main Dashboard page to ensure that the orders query is correctly initialized and that data is being passed to child components (SummaryCards, TotalOrdersTab, etc.) with intact quantity fields. Verify error handling doesn't mask quantity-related issues."
        },
        {
          "path": "frontend/src/pages/KarigarDetail.tsx",
          "operation": "modify",
          "description": "Verify that the KarigarDetail page correctly displays quantity values for the karigar's pending orders. Ensure export functions (PDF, JPEG, Excel) include quantity data."
        },
        {
          "path": "frontend/src/utils/exportUtils.ts",
          "operation": "modify",
          "description": "Review export utility functions to ensure quantity values are correctly included when exporting orders to Excel or PDF. Handle bigint-to-number conversion if needed for export libraries."
        }
      ]
    }
  ]
}