{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix RB partial supply calculation and consolidation logic",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix summary card recalculation when RB order is partially supplied: decrement Total Orders by 1, show '1 RB Pending' indicator, reduce Total Qty and Total Weight by supplied amounts, keep Customer Order count unchanged",
      "acceptanceCriteria": [
        "After confirming a partial RB supply, the Total Orders count in the summary card decreases by exactly 1.",
        "A '1 RB Pending' indicator appears on the Total Orders summary card after partial RB supply.",
        "Total Qty in the summary card decreases by exactly the supplied quantity entered in the popup.",
        "Total Weight in the summary card decreases by exactly the weight corresponding to the supplied quantity.",
        "Customer Order count in the summary card remains unchanged after a partial RB supply."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/SummaryCards.tsx",
          "operation": "modify",
          "description": "Update the calculation logic to correctly handle partial RB supplies: when an RB order is partially supplied, decrement the total orders count by 1 (not by the ratio of supplied qty), subtract the supplied quantity from Total Qty, subtract the corresponding supplied weight from Total Weight, display a '1 RB Pending' indicator when applicable, and ensure Customer Order count (CO-type orders) remains unchanged. The fix must occur in the data aggregation logic that computes summary metrics from the orders array."
        },
        {
          "path": "frontend/src/components/dashboard/SuppliedQtyDialog.tsx",
          "operation": "modify",
          "description": "Ensure that after calling batchSupplyRBOrders, the component triggers a refetch or state update so that SummaryCards.tsx receives the updated order data reflecting the partial supply. No UI or workflow changes; only ensure proper data flow and invalidation of cached queries so the summary card recalculates correctly."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix summary card restoration when partially supplied RB order is returned to Pending: restore Total Orders count, Total Qty, and Total Weight to their pre-supply values, keep Customer Order count unchanged",
      "acceptanceCriteria": [
        "After Return to Pending, Total Orders count in the summary card is restored to the value before the partial supply.",
        "After Return to Pending, Total Qty is restored to the value before the partial supply.",
        "After Return to Pending, Total Weight is restored to the value before the partial supply.",
        "Customer Order count remains unchanged throughout the return-to-pending flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "Update the return-to-pending logic to ensure that when a partially supplied RB order is returned to Pending status, the backend mutation is called with the correct returned quantity, and after the mutation completes, all relevant queries are invalidated so that SummaryCards.tsx recalculates totals from fresh data. The fix must ensure that the restored pending order(s) contribute their full original quantity and weight back into the summary card totals. No UI or workflow changes."
        },
        {
          "path": "frontend/src/components/dashboard/SummaryCards.tsx",
          "operation": "modify",
          "description": "Verify and adjust the calculation logic to correctly handle return-to-pending flows: when an RB order fragment is returned to Pending, ensure that the Total Orders count increments back by 1 (not by a ratio), Total Qty and Total Weight are restored by adding back the returned quantity and weight, and Customer Order count remains unchanged. This may involve tracking or reconstructing the original pre-supply values from the order data structure."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement mandatory RB row consolidation logic: when a partially supplied RB order is returned to Pending, automatically merge all pending fragments of the same logical RB order into a single consolidated row with combined quantity and weight before display or any Mark as Ready action, and ensure the supplied quantity popup appears only once per logical RB order",
      "acceptanceCriteria": [
        "After Return to Pending, all split fragments of the same logical RB order are merged into a single row in the pending list.",
        "The merged row shows the sum of quantities and weights of all merged fragments.",
        "The supplied quantity popup appears only once for a logical RB order, not once per split fragment.",
        "Before any Mark as Ready action for an RB order, split fragments are auto-merged into one consolidated row.",
        "No duplicate RB rows for the same logical order exist in the pending list at any time."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Implement RB row consolidation logic that merges split fragments of the same logical RB order into a single consolidated row before rendering the pending orders table. Use the orderNo field (or originalOrderId if present) to identify fragments belonging to the same logical RB order. Sum the quantity and weight of all fragments and display them as one row. Ensure that when the user selects a consolidated RB row and clicks Mark as Ready, the supplied quantity dialog receives the consolidated row data (not individual fragments), so the popup appears only once per logical RB order. No UI or workflow changes; only data transformation and consolidation logic."
        },
        {
          "path": "frontend/src/components/dashboard/SuppliedQtyDialog.tsx",
          "operation": "modify",
          "description": "Ensure that the dialog only processes consolidated RB rows (one entry per logical RB order) rather than multiple split fragments. When the dialog is opened with a list of selected orders, verify that RB-type orders have been pre-consolidated in TotalOrdersTab.tsx so that the user enters the supplied quantity only once per logical RB order. If any consolidation state is needed, handle it via the orders prop passed from TotalOrdersTab. No UI changes."
        },
        {
          "path": "frontend/src/pages/AgeingStock.tsx",
          "operation": "modify",
          "description": "Apply the same RB row consolidation logic as in TotalOrdersTab.tsx: before displaying pending orders grouped by design code, merge split RB fragments of the same logical order (identified by orderNo or originalOrderId) into a single consolidated row with summed quantity and weight. Ensure that when the user selects a consolidated RB row and triggers Mark as Ready, the supplied quantity dialog operates on the consolidated row, not on individual fragments. No UI or workflow changes."
        },
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "When returning a partially supplied RB order to Pending, ensure that after the backend mutation completes and queries are invalidated, the pending orders list (displayed in TotalOrdersTab or AgeingStock) will automatically consolidate any resulting split fragments due to the consolidation logic in those components. No additional consolidation logic is needed in ReadyTab itself; just ensure proper query invalidation so that the pending list re-renders with consolidated rows. No UI changes."
        }
      ]
    }
  ]
}