{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Order management system with Regional Buffer (RB) order handling. Built on Version 112. RB orders can partially split across tabs (Total Orders and Ready) when a partial quantity is supplied via a popup on 'Mark as Ready'. The system must treat split RB lines as one logical order, correctly merging/splitting summary calculations, order counts, and weights without changing UI, database structure, or workflows.",
  "architectural_notes": [
    "RB (Regional Buffer) orders are one logical unit even when split across tabs; supplied qty moves to Ready, pending qty stays in Total Orders",
    "Mark as Ready popup on RB orders accepts a supplied quantity, triggering a logical split if less than full order qty",
    "When remaining pending RB qty also moves to Ready, both parts must merge into a single row (qty, weight, order count = 1)",
    "When a supplied RB line is returned while a pending portion exists, merge back into the original full row and restore original qty/weight/count",
    "Do NOT change: row selection logic, status update workflow, layout, database structure, tab structure, UI, or any existing feature behavior"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-when-one-or-more-rb-type-orders-are-selected-in-the-total-orders-tab-and-the-user-clicks-mark-as-ready-display-a-popup-dialog-one-rb-order-at-a-time-prompting-the-user-to-enter-the-supplied-quantity-for-that-order-the-dialog-must-show-the-order-details-order-number-design-code-total-ordered-quantity-and-an-input-field-for-supplied-quantity-the-supplied-quantity-must-be-validated-to-be-greater-than-0-and-not-exceed-the-total-ordered-quantity",
      "title": "When one or more RB-type orders are selected in the Total Orders tab and the user clicks 'Mark as Ready', display a popup dialog (one RB order at a time) prompting the user to enter the supplied quantity for that order. The dialog must show the order details (order number, design code, total ordered quantity) and an input field for supplied quantity. The supplied quantity must be validated to be greater than 0 and not exceed the total ordered quantity.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-when-the-supplied-quantity-entered-in-the-popup-equals-the-full-ordered-quantity-for-an-rb-order-mark-the-entire-order-as-ready-and-move-it-fully-to-the-ready-tab-no-splitting-should-occur-the-total-orders-tab-removes-the-order-and-the-ready-tab-gains-it-as-a-single-row",
      "title": "When the supplied quantity entered in the popup equals the full ordered quantity for an RB order, mark the entire order as Ready and move it fully to the Ready tab. No splitting should occur. The Total Orders tab removes the order and the Ready tab gains it as a single row.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-when-the-supplied-quantity-entered-in-the-popup-is-less-than-the-full-ordered-quantity-for-an-rb-order-partial-supply-split-the-order-logically-move-the-supplied-portion-to-the-ready-tab-as-a-new-ready-row-and-keep-the-remaining-pending-portion-in-the-total-orders-tab-with-the-reduced-quantity-and-weight-both-rows-must-share-the-same-original-order-identifier-so-they-can-be-merged-later",
      "title": "When the supplied quantity entered in the popup is less than the full ordered quantity for an RB order (partial supply), split the order logically: move the supplied portion to the Ready tab as a new ready row, and keep the remaining (pending) portion in the Total Orders tab with the reduced quantity and weight. Both rows must share the same original order identifier so they can be merged later.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-when-the-remaining-pending-portion-of-a-previously-split-rb-order-is-subsequently-marked-as-ready-via-the-same-popup-flow-merge-the-two-portions-into-a-single-row-in-the-ready-tab-showing-the-combined-full-quantity-and-weight-the-bracket-indicator-in-total-orders-must-disappear-and-the-order-must-be-fully-removed-from-total-orders-the-merged-ready-row-must-appear-as-one-single-order-not-two",
      "title": "When the remaining pending portion of a previously split RB order is subsequently marked as ready (via the same popup flow), merge the two portions into a single row in the Ready tab showing the combined full quantity and weight. The bracket indicator in Total Orders must disappear and the order must be fully removed from Total Orders. The merged Ready row must appear as one single order, not two.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-when-a-supplied-ready-portion-of-a-split-rb-order-is-returned-to-pending-from-the-ready-tab-and-a-pending-portion-of-that-same-order-already-exists-in-total-orders-merge-the-returned-quantity-back-with-the-existing-pending-row-to-restore-the-original-full-order-the-order-count-qty-and-weight-in-total-orders-must-be-restored-to-their-original-values-and-the-bracket-indicator-must-disappear",
      "title": "When a supplied (ready) portion of a split RB order is returned to pending from the Ready tab, and a pending portion of that same order already exists in Total Orders, merge the returned quantity back with the existing pending row to restore the original full order. The order count, qty, and weight in Total Orders must be restored to their original values and the bracket indicator must disappear.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-when-a-fully-supplied-rb-order-no-prior-split-is-returned-from-the-ready-tab-to-pending-treat-it-as-a-normal-single-row-re-added-to-total-orders-with-its-full-quantity-and-weight-no-merging-logic-is-required-in-this-case",
      "title": "When a fully supplied RB order (no prior split) is returned from the Ready tab to pending, treat it as a normal single row re-added to Total Orders with its full quantity and weight. No merging logic is required in this case.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "RB order split/merge logic: when partial qty is supplied via Mark as Ready popup, split order across Total Orders and Ready tabs, merge back when remaining qty is supplied or returned, with correct summary calculations and order counts",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Ensure that all summary cards (total orders count, total weight, total quantity) in both the Total Orders tab and Ready tab accurately reflect the RB split/merge state at all times. Order counts must treat a split RB order as one logical order (not two), weights and quantities must be proportionally recalculated based on supplied vs pending portions, and no double-counting must occur.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Order Management System",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}