{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Order management app with karigar tracking, ageing stock reporting, and RB order handling. Active fixes: (1) ageing stock order date parsing from Excel column C + search bar, (2) total orders sorted by overdue days within each design code group, (3) RB return validation fix, (4) summary bracket for partial RB orders, (5) merge-back logic for returned RB ready rows.",
  "architectural_notes": [
    "Ageing stock page must read from the same live orders store as the dashboard (no separate snapshot).",
    "RB partial orders create split rows; each split row is independent for return validation purposes.",
    "Summary card counts unique order numbers with pending splits to display (Y pending) bracket."
  ],
  "known_issues": [
    "Ageing stock shows 'no date' because Excel column C (order date) is not being parsed and stored during ingest.",
    "RB return fails with qty mismatch error because validation compares row qty against original full order qty.",
    "Returning a ready RB split row creates a new pending row instead of merging with existing pending row."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-in-the-total-orders-tab-totalorderstab-tsx-after-grouping-pending-returnfromhallmark-orders-by-design-code-sort-the-orders-within-each-design-code-group-by-overdue-days-in-descending-order-most-overdue-oldest-order-date-first-overdue-days-should-be-calculated-as-the-number-of-days-elapsed-since-the-order-s-orderdate-orders-with-a-null-or-missing-orderdate-should-be-placed-at-the-bottom-of-each-group",
      "title": "In the Total Orders tab (TotalOrdersTab.tsx), after grouping Pending/ReturnFromHallmark orders by design code, sort the orders within each design code group by overdue days in descending order (most overdue / oldest order date first). Overdue days should be calculated as the number of days elapsed since the order's orderDate. Orders with a null or missing orderDate should be placed at the bottom of each group.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Ageing stock: parse order date from Excel column C, display overdue days, add design code search bar",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Total Orders dashboard: sort orders by overdue days within each design code group (most overdue first)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix RB return validation to compare against row qty not full order qty",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Summary card: show reduced count with (Y pending) bracket for partially supplied RB orders",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Return-to-pending for RB split rows: merge returned qty back into existing pending row by order number",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Sort Total Orders by overdue days within each design code group",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}