{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Order management system with SO/CO/RB order types ingested via order type column. Features partial RB (Regional Buffer Order) supply flow with supplied quantity popup, summary card recalculation, and mandatory row consolidation. Includes Total Orders and Ready tabs with correct filtering.",
  "architectural_notes": [
    "RB (Regional Buffer Order) must be treated as one logical order at all times — split fragments must auto-merge before any 'Mark as Ready' action",
    "Summary cards (Total Orders, Total Weight, Total Qty, Customer Order) must recalculate immediately after RB partial supply confirmation",
    "When partial RB is returned to Pending, all totals must fully restore and the row must consolidate back into a single line",
    "Supplied qty popup must appear only once per logical RB order, not per split fragment"
  ],
  "known_issues": [
    "RB partial supply: Total Orders summary card does not recalculate after partial Mark as Ready (qty/weight/count not updating)",
    "RB Return to Pending: totals not fully restoring to original values",
    "RB consolidation missing: returning partial RB to pending creates split rows instead of merging into one"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-when-an-rb-order-is-partially-marked-as-ready-via-the-supplied-quantity-popup-the-total-orders-summary-card-must-immediately-recalculate-decrement-total-orders-count-by-1-and-display-a-1-rb-pending-indicator-reduce-total-qty-by-the-supplied-quantity-reduce-total-weight-by-the-corresponding-supplied-weight-and-leave-customer-order-count-unchanged-this-recalculation-must-happen-at-the-data-and-state-level-only-with-no-ui-workflow-or-structural-changes",
      "title": "When an RB order is partially marked as Ready via the supplied quantity popup, the Total Orders summary card must immediately recalculate: decrement Total Orders count by 1 and display a '1 RB Pending' indicator, reduce Total Qty by the supplied quantity, reduce Total Weight by the corresponding supplied weight, and leave Customer Order count unchanged. This recalculation must happen at the data and state level only with no UI, workflow, or structural changes.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-when-a-partially-supplied-rb-order-is-marked-return-to-pending-from-the-ready-tab-the-total-orders-summary-card-totals-must-fully-restore-to-their-pre-supply-original-values-total-orders-count-increases-back-by-1-total-qty-increases-by-the-previously-supplied-quantity-total-weight-increases-by-the-previously-supplied-weight-and-customer-order-count-remains-unchanged",
      "title": "When a partially supplied RB order is marked Return to Pending from the Ready tab, the Total Orders summary card totals must fully restore to their pre-supply original values: Total Orders count increases back by 1, Total Qty increases by the previously supplied quantity, Total Weight increases by the previously supplied weight, and Customer Order count remains unchanged.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-mandatory-rb-row-consolidation-logic-when-a-partially-supplied-rb-order-is-returned-to-pending-the-remaining-pending-fragment-and-any-other-pending-fragments-of-the-same-logical-rb-order-must-automatically-merge-into-a-single-consolidated-row-with-combined-quantity-and-weight-before-being-displayed-or-before-any-further-mark-as-ready-action-is-allowed-the-supplied-quantity-popup-must-appear-only-once-per-logical-rb-order-not-separately-for-each-split-fragment-no-ui-structural-or-workflow-changes-are-permitted-only-the-data-consolidation-and-merge-logic-must-change",
      "title": "Implement mandatory RB row consolidation logic: when a partially supplied RB order is returned to Pending, the remaining pending fragment and any other pending fragments of the same logical RB order must automatically merge into a single consolidated row with combined quantity and weight before being displayed or before any further Mark as Ready action is allowed. The supplied quantity popup must appear only once per logical RB order, not separately for each split fragment. No UI, structural, or workflow changes are permitted - only the data consolidation and merge logic must change.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "gameProjectType": "none",
  "projectName": "Fix RB partial supply calculation and consolidation logic",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}