{
  "backend/main.mo": "Main Motoko actor defining order management system with types (Order, OrderType, OrderStatus, DesignMapping, Karigar), persistent maps for orders/mappings/images, and functions for saving orders, supplying quantities (splitting orders), managing karigars, design mappings, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting verification of RB order splitting logic that preserves karigarName and genericName fields when marking orders as ready with supplied quantities.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components including dashboard tabs, order management, karigar views, master design upload, image handling, and filtering/search functionality across the application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, sidebar, charts, etc.) using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying only CO (Customer Order) type orders with Pending status, featuring search by order number and using OrderTable for display.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog component for viewing design images with zoom (0.5x-3x) and pan functionality, supporting both mouse and touch interactions, fetching images via useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays hallmark orders with filters for order type (CO/RB), karigar name, search by order number, and date range. Uses OrderTable component to render filtered results.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows pending orders grouped by karigar name in card format, displaying total orders and weight per karigar. Cards are clickable and navigate to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with optional bulk selection, design image modal, export functionality (Excel/PDF/JPEG), and mark-as-ready action with special handling for RB orders.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with 'Ready' status, providing filters for order type, karigar name, search, and date range. Similar structure to HallmarkTab but filtered to Ready status orders.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary metric cards showing total orders, total weight, total quantity, and customer orders count with loading states and icons.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity when marking RB orders as ready. Handles single order (with quantity input validation) or bulk orders (supplies full quantities automatically).",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays a filterable table of pending and return-from-hallmark orders with filters for order type (CO/RB), karigar name, and order number search. Handles marking RB orders as ready with a supplied quantity dialog.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Shows an alert banner for unmapped design codes with counts and missing field information (generic name/karigar name). Provides navigation buttons to view all unmapped codes or update master designs.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the collapsible sidebar navigation with menu items for dashboard, order ingestion, unmapped codes, master designs, design images, tag printing, and barcode scanning. Includes branding header and footer with attribution.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design code to karigar mappings with ability to select existing karigars or add new ones. Updates mappings and reassigns pending orders to the new karigar.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Full-screen modal that embeds an external MPN system URL in an iframe with loading state and sandboxed permissions. Used for tag printing workflow integration.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and authentication status tracking. Creates AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders, including filtering by status/type/karigar, enriching orders with design mapping data, and bulk status updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes (including gold accents), transitions, hover states, and focus styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning functionality supporting both hardware scanners and camera-based QR scanning, with bulk order status updates and visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing total orders, ready orders, hallmark orders, customer orders, karigars, and an unmapped designs section.",
  "frontend/src/pages/DesignImages.tsx": "Handles bulk upload of design images via folder selection or ZIP file, extracting design codes from filenames and uploading images to the backend with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Parses and uploads orders from Excel files in batches, validating against master design mappings and displaying upload progress and error results.",
  "frontend/src/pages/KarigarDetail.tsx": "Displays detailed view of a specific karigar showing their assigned orders with filtering by status, totals calculation, and export functionality to PDF/JPEG. Includes a dialog for handling supplied quantities for RB-type pending orders.",
  "frontend/src/pages/MasterDesigns.tsx": "Manages master design mappings by allowing Excel upload of design-to-karigar assignments, displays all mappings in a table, and handles bulk operations including karigar creation, design mapping updates, and automatic order assignment with progress tracking.",
  "frontend/src/pages/TagPrinting.tsx": "Provides interface for printing tags for ready orders via MPN system integration, featuring login status tracking, webview modal for system access, and batch processing with progress indication.",
  "frontend/src/pages/UnmappedCodes.tsx": "Lists design codes from orders that lack generic name or karigar assignment, grouped by design code with inline editing capability to update mappings and track affected order counts.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files for both order data and master design mappings using SheetJS library, with design code normalization, chunked processing to prevent UI blocking, and comprehensive error tracking for validation issues.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export order data to Excel (using SheetJS from CDN) and PDF formats, with PDF export supporting design image embedding, grouping by design code, and numeric sorting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color schemes (using OKLCH), typography, container settings, sidebar styles, and chart colors with dark mode support.",
  "project_state.json": "Project metadata tracking a bug fix for Karigar/generic name display issues in Version 41 dashboard, with architectural notes on RB order splitting and status filtering features."
}