{
  "backend/main.mo": "Main backend actor implementing order management with CRUD operations for orders, karigars, design mappings, and design images, including blob storage integration and master design Excel handling.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: embedding actual design images in PDF exports and restoring colorful PDF structure with green headers and design grouping.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing component functionality, routing, data flow, and UI features across the application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like sidebar, cards, borders, and charts.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div for mounting the app.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes, QueryClient, ThemeProvider, and SidebarProvider with responsive mobile layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying customer orders (CO type) using useGetOrdersByType hook and OrderTable component with loading state.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for viewing design images with zoom controls (0.5x-3x), pan functionality via mouse/touch, and loading/error states using useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Tab component displaying hallmark orders using useGetHallmarkOrders hook with date filtering enabled and OrderTable component.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Displays a grid of cards showing karigars with their pending orders, total order count, and total weight; clicking a card navigates to the karigar detail page.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Renders a table of orders grouped by design code with checkboxes for bulk selection, image preview, export options (Excel/PDF/JPEG), and bulk status update to Ready with confirmation dialog.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Fetches and displays orders with 'Ready' status using the OrderTable component with date filtering enabled.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count with loading states.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity for RB orders before marking them as Ready, with validation to ensure quantity is valid and doesn't exceed order quantity.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays orders with 'Pending' or 'ReturnFromHallmark' status in an OrderTable with bulk actions enabled.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Shows an alert banner listing design codes missing generic name or karigar mapping, with buttons to view all unmapped codes or update master designs.",
  "frontend/src/components/layout/AppSidebar.tsx": "Collapsible sidebar navigation with menu items for Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, and Barcode Scanning.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design-to-karigar mappings with dropdown selection of existing karigars or inline form to add a new karigar.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "A modal dialog component that displays an embedded iframe for the MPN System with loading state, external link icon, and instructions for completing login in the browser.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout with AuthClient, including identity persistence, delegation validation, and configurable idle/expiration handling.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating order data, including filtering by status/type/karigar, saving/deleting orders, and managing design mappings with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, defining colors for UI elements, gold accents, charts, sidebar, and enhanced interaction states with transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component for scanning order barcodes using either hardware barcode scanners (via keyboard events) or camera-based QR scanning, collecting scanned order IDs for bulk status updates with visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing total orders, ready orders, hallmark orders, customer orders, and karigars, including summary cards and an unmapped orders section.",
  "frontend/src/pages/DesignImages.tsx": "Page for uploading design images via folder or ZIP file, extracting filenames as design codes, converting images to blobs, and storing them in the backend with batch processing and progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Page for uploading and parsing order Excel files, validating design mappings exist in the backend, and batch-saving orders with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page displaying orders for a specific karigar with summary statistics (pending orders, total weight, quantity) and PDF export functionality.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading master design Excel files to create design-to-karigar mappings, displaying all mappings in a table, and allowing inline editing to reassign designs to different karigars.",
  "frontend/src/pages/TagPrinting.tsx": "Page for printing tags for ready orders via MPN system integration, requiring login through an embedded webview and processing orders with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page displaying design codes missing generic names or karigar assignments, grouped by design code with order counts, and allowing inline editing to complete mappings.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files for order data and master design data using SheetJS library loaded from CDN, with validation and error tracking for required fields.",
  "frontend/src/utils/exportUtils.ts": "Exports orders to Excel and PDF formats; PDF export groups orders by design code, sorts numerically, fetches design images from backend actor, converts to base64, and embeds them in HTML-based PDF with green headers and styling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container settings, and extended theme properties for the application UI.",
  "project_state.json": "Project state tracking document indicating known issues with PDF export not embedding actual design images and requesting restoration of colorful PDF structure with green headers."
}