{
  "backend/main.mo": "Main Motoko actor defining order management system with types for orders, design mappings, karigars, and functions for saving orders, managing karigars, design mappings, and assigning orders to karigars with persistent storage using Maps.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: adding Status columns to dashboard tabs, fixing Ready tab filtering, and correcting design code matching logic with product prefix handling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including dashboard tabs with filtering, order ingestion with batch processing, unmapped codes management, and mobile-responsive layouts with TanStack Router.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like sidebar, cards, borders, and charts using oklch color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System with viewport meta tag and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with eight routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying only CO (Customer Order) type orders with search functionality filtering by order number using client-side filtering with useMemo.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for displaying design images with zoom controls (0.5x to 3x), pan functionality via mouse/touch, and loading/error states using useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays orders with Hallmark status, providing filters for order type (CO/RB), karigar name, order number search, and date range selection. Renders filtered orders in an OrderTable component.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows a grid of cards for each karigar with pending orders, displaying total order count and weight. Each card is clickable and navigates to a detailed karigar view.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component that displays orders grouped by design code with support for bulk selection, status updates to Ready, design image viewing, and export functionality (Excel, PDF, JPEG). Includes confirmation dialogs for bulk actions.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, providing filters for order type (CO/RB), karigar name, order number search, and date range selection. Renders filtered orders in an OrderTable component.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count with loading states and icons.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity when marking RB orders as Ready, with validation to ensure quantity is valid and does not exceed order quantity.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays orders with Pending or ReturnFromHallmark status, providing filters for order type (CO/RB), karigar name, and order number search. Renders filtered orders in an OrderTable with bulk actions enabled.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Displays an alert banner showing unmapped design codes that lack generic or karigar names, with navigation buttons to view all unmapped codes or update master designs. Groups unmapped orders by design code and shows up to 5 entries with counts and missing field details.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the main application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning) and highlights the active route. Includes collapsible functionality and a footer with attribution to caffeine.ai.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design mappings by reassigning karigar to a design code, with functionality to select existing karigars or add new ones. Updates only affect pending orders and shows validation with toast notifications.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Full-screen modal that embeds an external MPN system URL in an iframe with loading state, sandboxed permissions, and instructions for completing login. Provides close button and loading indicator.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Includes status tracking (initializing, idle, logging-in, success, error) and automatic identity loading from local storage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating orders, design mappings, karigars, and design images from the backend actor. Includes filtered queries by status/type/karigar and mutations that automatically invalidate related query caches.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, gold accents, sidebar, charts) and global styles for transitions, hover states, and focus indicators.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Barcode scanning page supporting both hardware scanners (via keyboard events) and camera-based QR scanning, allowing users to scan order IDs and bulk update their status with visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing Total Orders, Ready orders, Hallmark orders, Customer Orders, and Karigars, including summary cards and an unmapped section for order management.",
  "frontend/src/pages/DesignImages.tsx": "Design image upload page that allows uploading images via folder selection or ZIP file, extracting design codes from filenames, and batch uploading images to the backend with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Order ingestion page that parses Excel files containing order data, validates against design mappings, and batch uploads orders to the backend with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Karigar (craftsman) detail page displaying pending orders for a specific karigar with summary statistics (total weight, quantity) and PDF export functionality for order lists.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for managing master design mappings with Excel upload functionality, allowing users to map design codes to generic names and karigars, reassign designs, and track upload progress with automatic order assignment.",
  "frontend/src/pages/TagPrinting.tsx": "Page for printing tags for ready orders via MPN system integration, featuring a webview modal for login, session management, and batch processing of orders with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page displaying design codes from orders that lack generic name or karigar assignments, grouped by design code with inline editing capabilities to update missing mappings.",
  "frontend/src/utils/excelParser.ts": "Utility for parsing Excel files containing order data and master design mappings, with design code normalization, chunked processing to prevent UI blocking, and comprehensive error validation.",
  "frontend/src/utils/exportUtils.ts": "Utility for exporting orders to Excel and PDF formats, with PDF generation including design images fetched from backend, numeric sorting of design codes, and mobile-friendly download handling for iOS and Android.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining dark mode, content paths, custom container settings, extended font families (Inter, Playfair Display), OKLCH-based color system with CSS variables for theming (primary, secondary, sidebar, chart colors), and custom border radius values.",
  "project_state.json": "Project state document describing an order management dashboard with multiple tabs (Total Orders, Ready Orders, Hallmark Orders, Customer Orders, Karigars), master Excel data mapping for design codes/karigar names, karigar filtering, export functionality, and listing seven known issues including missing status columns, filtering problems, and mobile export bugs."
}