{
  "backend/main.mo": "Main actor defining order management system with types for orders, design mappings, and karigars; includes functions for saving orders, supplying orders, managing karigars, design mappings, and blob storage integration with migration support.",
  "backend/migration.mo": "Migration module that transforms old orders by automatically changing orderType to #SO for BARS products with weight 10-500 that lack genericName and karigarName.",
  "feature_evidence.json": "Feature evidence report documenting a fix for summary cards in the Ready tab to display correct counts and metrics matching the deduplicated order list.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including dashboard tabs, order management, karigar management, master design upload, and various UI components with their filtering and navigation logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, sidebars, and charts.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying only CO type orders with Pending status, featuring search functionality by order number using client-side filtering with useMemo.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for displaying design images with zoom (0.5x-3x) and pan controls, supporting both mouse and touch interactions, fetching images via useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays hallmark orders with filters for order type (CO/RB), karigar, search text, and date range; fetches hallmark orders and unique karigars, then renders filtered results in OrderTable.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows pending orders grouped by karigar name in clickable cards displaying total orders and weight; navigates to individual karigar detail pages on click.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Renders a table of orders with optional bulk selection, design image modal, export functionality (Excel/PDF/JPEG), and mark-as-ready action with confirmation dialog; handles RB orders differently by triggering supply dialog.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, deduplicates by orderId, and provides filters for order type, karigar, search text, and date range; renders results in OrderTable.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards (total orders, total weight, total quantity, customer orders) with metrics calculated from filtered orders based on active tab; handles deduplication for ready tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Dialog for entering supplied quantity for RB orders before marking as ready; handles single order with quantity input validation or multiple orders with full quantity supply.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays a filterable table of pending and returned-from-hallmark orders with search, order type (CO/RB), and karigar filters. Includes functionality to mark RB orders as ready with a supplied quantity dialog.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Shows an alert banner for unmapped design codes with counts and missing field information. Provides navigation buttons to view all unmapped codes or update master designs.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning) and footer with branding.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design-to-karigar mappings with ability to select existing karigars or add new ones. Updates reassign pending orders to the new karigar.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Full-screen modal that embeds an external MPN system URL in an iframe with loading state and sandbox permissions for tag printing functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders, including filtering by status/type/karigar, enriching orders with design mapping data, and bulk status updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including gold accent colors, smooth transitions, hover/focus states, and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning functionality supporting both hardware scanners and camera-based QR scanning, with bulk order status updates and visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing total orders, ready orders, hallmark orders, customer orders, and karigars, plus summary cards and unmapped designs section.",
  "frontend/src/pages/DesignImages.tsx": "Handles bulk upload of design images from folders or ZIP files, extracting design codes from filenames and storing images in the backend with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Parses Excel files to import orders in batches, validates against design mappings, and displays upload progress with success/error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Displays detailed view of a specific karigar showing their pending orders with total weight/quantity, supports PDF/JPEG export, and handles marking RB orders as ready with a supplied quantity dialog.",
  "frontend/src/pages/MasterDesigns.tsx": "Manages master design mappings by allowing Excel upload of design-to-karigar assignments, handles bulk processing with progress tracking, and automatically assigns orders to karigars based on mappings while tracking unmapped orders.",
  "frontend/src/pages/TagPrinting.tsx": "Provides interface for printing tags for ready orders via MPN system, includes webview modal for MPN login, and simulates batch processing of orders with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Displays design codes from orders that lack generic name or karigar assignment, groups them by design code with order counts, and allows inline editing to add missing mappings.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files for orders and master design mappings using SheetJS, normalizes design codes to uppercase for consistent matching, validates required fields, and processes data in chunks to prevent UI blocking.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export orders to Excel (using SheetJS) and PDF formats, including fetching design images from backend, converting them to base64, grouping/sorting orders by design code, and generating HTML-based PDFs with embedded images.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system with semantic tokens (primary, secondary, gold, sidebar, chart colors), custom font families (Inter, Playfair Display), container settings, and border radius variables.",
  "project_state.json": "Project state tracking file indicating two known issues: SO parsing not applied to existing orders and incorrect Ready tab summary values, with three pending feature requests to address these issues."
}