{
  "backend/main.mo": "Main Motoko actor defining Order, DesignMapping, and Karigar types with persistent storage maps, providing functions for order management, karigar CRUD, design mapping with reassignment, and includes blob storage mixin for image handling.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing Excel parser header matching, adding enhanced error logging, and ensuring support for both .xls and .xlsx file formats in frontend/src/utils/excelParser.ts.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the mobile-responsive React application with TanStack Router, order management tabs, Excel upload with batch processing, design image handling, barcode scanning, and React Query hooks for backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components including sidebar, borders, and chart colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System with viewport meta tag and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with seven routes (Dashboard, IngestOrders, UnmappedCodes, MasterDesigns, DesignImages, TagPrinting, BarcodeScanning), wrapped in SidebarProvider and ThemeProvider with mobile-responsive layout including hamburger menu trigger.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying Customer Order (CO) type orders using OrderTable with selection state management and selected count display.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for viewing design images with zoom controls (0.5x to 3x), pan functionality via mouse/touch drag, and loading/error states using useDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Tab displaying hallmark orders with status filter dropdown (all/hallmark/return), bulk selection, and action button to update selected orders to ReturnFromHallmark status.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Displays pending orders grouped by karigar (craftsperson) in card format, allows selecting orders within a karigar group via a modal dialog, and provides bulk status update to 'Ready'.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with search, filtering by order type and date range, row selection via checkboxes, and export functionality to Excel, PDF, and JPEG formats.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders filtered by 'Ready' status using the OrderTable component with selection support but no bulk actions.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count with loading states.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays pending orders in a table with multi-select capability and a bulk action button to change selected orders' status to 'Ready'.",
  "frontend/src/components/layout/AppSidebar.tsx": "Collapsible sidebar navigation component with menu items for dashboard, order ingestion, unmapped codes, master designs, design images, tag printing, and barcode scanning.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity state management using AuthClient, including status tracking and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders (with filtering by status, type, search), saving orders, bulk status updates, and managing karigars. Includes frontend filtering logic since backend doesn't filter.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes (including gold accents), transitions, hover/focus states, and disabled styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning page with hardware scanner and camera QR scanning modes, allowing users to scan order IDs and bulk update their status.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for Total Orders, Ready, Hallmark, Customer Orders, and Karigars, displaying summary cards and tab-specific content.",
  "frontend/src/pages/DesignImages.tsx": "Handles bulk upload of design images via folder selection or ZIP file, extracting filenames as design codes and uploading images to the backend with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Provides Excel file upload functionality to parse and batch ingest orders, displaying parsed data, validation errors, and upload progress.",
  "frontend/src/pages/MasterDesigns.tsx": "React page component for managing design-to-karigar mappings via Excel upload, with features for reassigning karigars, adding new karigars, and searching/filtering mappings.",
  "frontend/src/pages/TagPrinting.tsx": "React page component for processing ready orders for tag printing in batches by design, with login session management and progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "React page component displaying orders without design mappings in a table, allowing users to manually assign generic names and karigar names.",
  "frontend/src/utils/excelParser.ts": "Utility functions for parsing Excel files using SheetJS (XLSX) to extract order data and master design mappings with validation and error reporting.",
  "frontend/src/utils/exportUtils.ts": "Utility functions for exporting order data to Excel, CSV, and PDF formats with fallback mechanisms and browser-based rendering.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH color space, font families (Inter and Playfair Display), container settings, and border radius variables. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a jewelry management system with karigar (artisan) mapping functionality that has an active bug where the Excel parser fails to correctly read data from columns A (Design Code), B (Generic Name), and C (Karigar Name) despite data being present."
}