{
  "backend/main.mo": "Main Motoko actor implementing a jewellery order management system with order tracking (Pending/Ready/Hallmark/ReturnFromHallmark statuses), design mappings, karigar management, blob storage for design images and Excel files, and functions for order ingestion, supply tracking, and design-to-karigar assignments.",
  "feature_evidence.json": "Feature evidence report documenting the fix for an infinite setState loop in the Dashboard component caused by the onFilteredOrdersChange callback, with high confidence and references to Dashboard.tsx file.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the React application structure including Dashboard with tab management, order tables, karigar management, Excel/image upload pages, and callback props to prevent re-render loops.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like sidebar, cards, borders, and charts using oklch color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with 8 routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying CO-type orders with Pending status, featuring search by order number and notifying parent of filtered orders via onFilteredOrdersChange callback.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog component for viewing design images with zoom (0.5x-3x) and pan functionality, supporting both mouse and touch interactions, fetching images via useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays hallmark orders with filters for order type (CO/RB), karigar, search text, and date range; notifies parent component of filtered orders and loading state.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows pending orders grouped by karigar name with summary cards displaying total orders and weight per karigar; clicking a card navigates to the karigar detail page.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Renders a table of orders with optional bulk selection, design image modal, export functionality (Excel/PDF/JPEG), and mark-as-ready action with special handling for RB orders requiring supply quantity.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, providing filters for order type, karigar, search text, and date range; notifies parent of filtered orders and loading state.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count with loading state support.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity for RB orders before marking as ready; handles single order with input validation or multiple orders with full quantity supply.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays and filters orders with Pending or ReturnFromHallmark status, supporting filters by order type (CO/RB), karigar name, and order number search. Handles marking RB orders as ready with a supplied quantity dialog and notifies parent component of filtered order changes.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Displays an alert banner showing unmapped design codes with missing generic or karigar names, listing up to 5 codes with their order counts. Provides navigation buttons to view all unmapped codes or update master designs.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning) and highlights the active route. Includes header with app branding and footer with attribution link.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design code to karigar mappings, allowing selection of existing karigars or adding new ones. Updates the mapping and reassigns pending orders to the new karigar upon save.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Full-screen modal dialog that embeds an external MPN system URL in an iframe with loading state and sandbox permissions. Provides close button and informational footer for completing login in the embedded browser.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hook for Internet Identity authentication, managing login status, identity state, and AuthClient lifecycle. Supports creating auth clients with custom options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders, design mappings, karigars, and related data from the backend actor. Includes hooks for filtering orders by status/type/karigar, uploading design mappings, bulk status updates, and managing order lifecycle operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including gold accent colors for jewelry business branding. Defines global styles for transitions, hover states, focus states, and disabled states.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning functionality supporting both hardware scanners and camera-based QR scanning for order tracking. Allows bulk status updates of scanned orders with visual feedback and duplicate detection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing total orders, ready orders, hallmark orders, customer orders, and karigars. Includes summary cards and an unmapped orders section with filtered order state management.",
  "frontend/src/pages/DesignImages.tsx": "Provides UI for uploading design images either from a folder or ZIP file, extracting filenames as design codes and storing images in the backend. Supports batch processing with progress tracking and error reporting.",
  "frontend/src/pages/IngestOrders.tsx": "Handles bulk order ingestion from Excel files by parsing order data and saving to backend in batches. Displays upload progress and validation errors, with backend handling design mapping lookups.",
  "frontend/src/pages/KarigarDetail.tsx": "Displays detailed view of a specific karigar showing their pending orders, total weight, and quantity with options to export to PDF and mark orders as ready. Includes a dialog for handling RB-type orders that require supplied quantity input.",
  "frontend/src/pages/MasterDesigns.tsx": "Manages master design mappings by allowing Excel upload to map design codes to generic names and karigars, with progress tracking and automatic order assignment. Provides a table view with edit functionality and handles bulk operations including karigar creation and order mapping.",
  "frontend/src/pages/TagPrinting.tsx": "Provides interface for printing tags for ready orders via MPN system integration. Includes login status tracking, webview modal for MPN system access, and batch processing with progress indication.",
  "frontend/src/pages/UnmappedCodes.tsx": "Displays design codes from orders that lack generic name or karigar assignment, grouped by design code with order counts. Allows inline editing to add missing mappings and updates all orders with that design code.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files for order data and master design mappings using SheetJS library with chunked processing to prevent UI blocking. Normalizes design codes to uppercase and validates required fields, returning parsed data with error details.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export order data to Excel (using SheetJS from CDN) and PDF formats, with PDF export supporting design image embedding, grouping by design code, and numeric sorting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color schemes (using OKLCH), typography, container settings, font families, border radius variables, and various UI component tokens for sidebar, charts, and semantic colors.",
  "project_state.json": "Project state metadata tracking a bug fix for an infinite setState loop causing 'maximum update depth exceeded' error in Dashboard component, with pending feature requests to add memoization and fix callback dependencies."
}