{
  "backend/main.mo": "Main Motoko actor defining order management system with types (Order, OrderType, OrderStatus, DesignMapping, Karigar), persistent storage maps for orders/designs/karigars, and functions for saving orders, managing karigars, design mappings, and bulk order assignments.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features with high confidence: filtering pending orders in Total Orders tab, removing ready orders from karigar views, updating summary cards based on filtered data, filtering CO orders in Customer Orders tab, and reordering table columns.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including dashboard tabs with filtering/callbacks, order ingestion with batch processing, master design management with Excel upload, design image handling, and karigar detail navigation.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, sidebar, and chart elements.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'Jewellery Order Management System', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and SidebarProvider layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying only CO type orders with search filter by order number and callback to notify parent component of filtered orders for summary card updates.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog component for viewing design images with zoom controls (0.5x to 3x), pan functionality via mouse/touch, loading/error states, and fetches design image data using useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays and filters hallmark orders with controls for order type, karigar, search text, and date range; notifies parent component of filtered results.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows pending orders grouped by karigar name in cards displaying total orders and weight; clicking a card navigates to the karigar detail page.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Renders a table of orders with optional bulk selection, mark-as-ready functionality, design image modal, and export options (Excel, PDF, JPEG).",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, providing filters for order type, karigar, search text, and date range; notifies parent of filtered results.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count with loading state support.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity for RB orders before marking as ready, with validation to ensure quantity doesn't exceed order quantity.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Shows pending orders (excluding ReturnFromHallmark) with filters for order type, karigar, and search text; enables bulk actions and notifies parent of filtered results.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Displays an alert banner showing unmapped design codes (missing generic or karigar names) with counts and navigation buttons to view all unmapped codes or update master designs.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders the application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning) and footer with branding.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design mappings, allowing users to change the karigar assignment for a design code and add new karigars, with validation and success/error toasts.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Modal component that embeds an external MPN system URL in an iframe with loading state, allowing users to interact with the external system within the app.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating orders, design mappings, karigars, and design images, with filtering by status, type, and search text, plus cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, gold accents, sidebar, charts) and global styles for transitions, hover states, and focus indicators.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/BarcodeScanning.tsx": "Barcode scanning page supporting both hardware scanners (via keyboard events) and camera-based QR scanning, allowing bulk order status updates with visual feedback and duplicate detection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for Total Orders, Ready, Hallmark, Customer Orders, and Karigars, displaying summary cards and an unmapped section with filtered order management.",
  "frontend/src/pages/DesignImages.tsx": "Design image upload page supporting folder and ZIP file uploads, extracting design codes from filenames and storing images as external blobs with batch processing and progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Excel order ingestion page that parses order data from uploaded files, validates against design mappings, and saves orders in batches with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Karigar detail page displaying pending orders for a specific karigar with summary statistics (total weight, quantity) and PDF export functionality.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for managing master design mappings with Excel upload functionality, allowing users to map design codes to generic names and karigars, track upload progress, and reassign designs through an edit modal.",
  "frontend/src/pages/TagPrinting.tsx": "Page for printing tags for ready orders via MPN system integration, featuring a webview modal for login and batch processing of orders with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page displaying design codes from orders that lack generic name or karigar assignments, grouped by design code with inline editing capability to add missing mappings.",
  "frontend/src/utils/excelParser.ts": "Utility for parsing Excel files containing order data and master design mappings, with design code normalization, chunked processing to prevent UI freezing, and validation error reporting.",
  "frontend/src/utils/exportUtils.ts": "Utility for exporting orders to Excel and PDF formats, with PDF export featuring grouped orders by design code, numeric sorting, and embedded design images fetched from the backend.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining dark mode, content paths, custom container settings, extended font families (Inter, Playfair Display), OKLCH-based color system with CSS variables for theming (primary, secondary, sidebar, chart colors), and custom border radius utilities.",
  "project_state.json": "Project state tracking file for a jewelry manufacturing order management dashboard with multiple tabs (Total Orders, Ready Orders, Karigar Orders, Customer Orders), documenting existing features for status-based filtering, tab-specific metrics, and column reordering, plus pending feature requests for order status transitions and dynamic dashboard updates."
}