{
  "backend/main.mo": "Main actor defining order management system with types for orders, design mappings, and karigars; includes functions for saving orders, managing karigars, design mappings, and blob storage integration with MixinStorage.",
  "backend/migration.mo": "Migration module defining persistent types (PersistentOrder, DesignMapping) and a run function that transfers orders and designMappings from old actor state to new actor state.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: row selection fix, sidebar display fix, Excel upload error fix, upload optimization, and master designs table display with inline editing.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx, layout components, dashboard tabs, order management pages, and utility pages with their key functionality and implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, borders, backgrounds, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Jewellery Order Management System', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with eight routes, QueryClient setup, ThemeProvider, SidebarProvider layout, and Toaster for notifications.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab component displaying CO type orders with real-time client-side search filtering by order number using a search input and OrderTable component.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "A modal dialog component that displays a design image with zoom and pan functionality, fetching the image via useGetDesignImage hook and supporting both mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays orders with Hallmark or ReturnFromHallmark status, providing filters for date range, order type, karigar, and search text, then rendering filtered results in an OrderTable.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows a grid of cards for each karigar with pending orders, displaying total order count and weight, with navigation to individual karigar detail pages on click.",
  "frontend/src/components/dashboard/OrderTable.tsx": "A table component for displaying orders with row selection, design image preview, export functionality (Excel/PDF/JPEG), and status actions to mark orders as Ready with optional supplied quantity input for RB orders.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, providing filters for date range, order type, karigar, and search text, then rendering filtered results in an OrderTable.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays four summary cards showing total orders, total weight, total quantity, and customer orders count, calculated from all orders fetched via useGetAllOrders hook.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "A dialog component for entering the supplied quantity for an RB order, validating that the input is positive and does not exceed the total order quantity before submission.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays a filterable table of pending and returned-from-hallmark orders with filters for order type (CO/RB), karigar name, and order number search.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Shows an alert banner for orders with unmapped design codes, grouping them by design and indicating missing generic or karigar names, with navigation to unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Renders a collapsible sidebar navigation menu with links to Dashboard, Ingest Orders, Master Designs, Design Images, Tag Printing, Barcode Scanning, and Unmapped Codes pages.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal dialog for editing design mappings, allowing selection of existing karigars or adding new ones, with functionality to save changes and reassign designs to different karigars.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Modal component that embeds an external MPN system URL in an iframe with loading state and sandboxed permissions for login and interaction.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient from DFINITY SDK.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for order management operations including fetching orders with filters, saving/deleting orders, updating order statuses, and managing design mappings and external blobs.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, plus responsive sidebar styles and mobile viewport fixes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning functionality supporting both hardware scanners and camera-based QR scanning, allowing bulk order status updates to 'Ready' with visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with summary cards, unmapped orders section, and tabbed views for Total Orders, Ready, Hallmark, Customer Orders, and Karigars workflows.",
  "frontend/src/pages/DesignImages.tsx": "Handles bulk upload of design images via folder selection or ZIP file, extracting design codes from filenames and storing images as external blobs with batch processing and progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Parses Excel files to bulk import orders, validating required fields (Order No, Type, Product, Design, Weight, Size, Qty), normalizing design codes, and reporting failed rows with error details.",
  "frontend/src/pages/KarigarDetail.tsx": "Displays detailed view of a specific karigar showing their pending/returned orders with statistics (total orders, quantity, unique designs) and PDF export functionality.",
  "frontend/src/pages/MasterDesigns.tsx": "Manages master design mappings by allowing Excel file uploads to bulk import design-to-karigar mappings, displays existing mappings in a table, and provides editing functionality.",
  "frontend/src/pages/TagPrinting.tsx": "Handles tag printing workflow for ready orders via MPN system integration, including login session management and batch processing with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Shows design codes from orders that lack generic name or karigar assignment, grouped by design code with inline editing to add missing mappings.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files to extract master design mappings (design code, generic name, karigar name) with validation and error reporting.",
  "frontend/src/utils/exportUtils.ts": "Provides export utilities to convert order data into Excel, PDF, and JPEG formats with consistent column ordering and formatting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining dark mode, content paths, custom theme extensions including fonts (Inter, Playfair Display), OKLCH-based color system with CSS variables, container settings, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking a production management app with order ingestion, master design management, and dashboard tabs. Lists known issues including row selection bugs, sidebar display problems on iPhone, failed order ingestion, slow uploads, and broken JPEG/PDF export, along with existing features for fixes and enhancements."
}