{
  "backend/main.mo": "Main actor implementing a jewelry order management system with order CRUD operations, design mappings, karigar management, blob storage for images/Excel, and status transitions (Pending→Ready→Hallmark→ReturnFromHallmark) including migration support for adding readyDate field.",
  "backend/migration.mo": "Migration module that adds a readyDate field to existing Order records, setting it to updatedAt for orders with Ready status and null otherwise.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: displaying generic names in tag printing, date-wise filtering by readyDate, bulk status changes from Ready to Hallmark, and marking Hallmark orders as Returned.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, dashboard tabs, order management pages, master data pages, and reusable components with details on search, filtering, bulk actions, and status management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens using oklch color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System React application with viewport meta tag and root div.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with eight routes (dashboard, ingest, unmapped, master designs, images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and responsive sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Dashboard tab component displaying CO (Customer Order) type orders with Pending status, featuring search functionality by order number, design code, or generic name using OrderTable component.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal component for viewing design images with zoom and pan functionality, fetches design images using a custom hook and supports both mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Displays orders with Hallmark status, provides filtering by order type, karigar, date range, and search text, and supports bulk marking orders as returned and Excel export.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Shows pending orders grouped by karigar name with summary cards displaying total orders and weight per karigar, with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with optional bulk selection, export functionality (Excel/PDF/JPEG), and actions like marking orders as ready or deleting them.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with Ready status, provides filtering and search capabilities, supports deleting ready orders (moving them back to Pending), and deduplicates orders by orderId.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Displays summary metrics (total orders, weight, quantity, customer orders) in card format, with filtering logic based on active tab and deduplication for the ready tab.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Dialog component for supplying quantities to RB orders, allowing partial or full supply for single orders and full supply for multiple orders, with order splitting logic and toast notifications.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Dashboard tab displaying Pending and ReturnFromHallmark orders with filtering by order type, karigar, and search text, plus handling RB order supply via SuppliedQtyDialog.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Alert component that displays unmapped design codes (missing generic name or karigar name) with counts and navigation buttons to unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Main application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning, Data Reset) and branding footer.",
  "frontend/src/components/layout/DataResetDialog.tsx": "Confirmation dialog for resetting/deleting all active orders (Pending, Ready, Return from Hallmark status) with detailed warning about affected tabs.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal for editing design mappings by reassigning karigar to a design code, with ability to add new karigars and automatic reassignment of pending orders.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages backend actor creation with Internet Identity authentication, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating order data, including filtering by status, date range, karigar, and mapping state, plus order creation/update mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes for UI components including gold accents, transitions, and focus states.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Implements barcode scanning functionality supporting both hardware scanners (via keyboard events) and camera-based QR scanning, with batch order status updates and duplicate detection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed interface for viewing total orders, ready orders, hallmark, customer orders, and karigars, plus an unmapped orders section and summary cards.",
  "frontend/src/pages/DesignImages.tsx": "Handles bulk design image uploads via folder selection or ZIP file, extracting filenames as design codes and uploading images in batches with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Handles bulk order ingestion from Excel files, parsing orders and uploading them in batches to the backend with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Displays detailed view of orders assigned to a specific karigar with filtering for daily/total orders, export functionality (PDF/JPEG/Excel), and ability to mark orders as ready with supplied quantity tracking.",
  "frontend/src/pages/MasterDesigns.tsx": "Manages master design Excel uploads, parses design-to-karigar mappings, stores them in the backend, and provides UI for editing design assignments with automatic order reassignment.",
  "frontend/src/pages/TagPrinting.tsx": "Shows ready orders grouped by design code with date range filtering, allows copying order numbers to clipboard, and supports marking design groups as hallmarked.",
  "frontend/src/pages/UnmappedCodes.tsx": "Lists orders with missing generic names or karigar assignments, grouped by design code, with inline editing to complete or update design mappings.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files to extract order data (Order No, Order Type, Product, Design, Weight, Size, Quantity, Remarks), normalizes design codes to uppercase for consistent matching, validates required fields, and processes data in chunks to prevent UI freezing.",
  "frontend/src/utils/exportUtils.ts": "Provides export functionality to Excel and PDF formats; Excel export includes order details, while PDF export groups orders by design code (sorted numerically), fetches design images from backend, converts them to base64, and generates mobile-responsive PDFs with enhanced image resolution using HTML2PDF.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including container settings, font families (Inter, Playfair Display), color palette using OKLCH color space with custom variables for UI components (sidebar, gold, chart colors), and border radius utilities.",
  "project_state.json": "Project state document describing a jewelry order management system with Master Design lookup, Karigar/Generic name auto-fill, Tag Printing with design groups, Hallmark workflow (READY → HALLMARK → Returned), tab-based dashboard, and export functionality across multiple tabs."
}