{
  "backend/main.mo": "Main actor implementing order management system with functions for saving, supplying, and returning orders; managing karigars and design mappings; handling blob storage for design images and Excel files; and supporting order status transitions (Pending, Ready, Hallmark, ReturnFromHallmark).",
  "backend/migration.mo": "Migration module defining type aliases for Order, OrderType, OrderStatus, and OldActor, with a run function that preserves orders and designImages maps during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: column reordering in OrderTable, red highlight for selected rows, search by design code and order number, RB order quantity validation fix, and associated test IDs with high confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, dashboard tabs, order management, karigar management, design uploads, and various UI components with their key functionality and recent changes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens using oklch color space.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'Jewellery Order Management System', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with eight routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and responsive sidebar layout.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying CO (Customer Order) type orders with Pending status only, featuring search functionality by order number and using OrderTable for display.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal component for displaying design images with zoom and pan functionality, fetches design image data using a custom hook and supports both mouse and touch interactions.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Tab component displaying orders with Hallmark or ReturnFromHallmark status, includes filtering by search query, order type, karigar, and date range.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Tab component showing pending orders grouped by karigar name with summary cards displaying total orders and weight per karigar, navigates to individual karigar detail pages on click.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Reusable table component for displaying orders with optional bulk selection, export functionality (Excel/PDF/JPEG), delete actions, and mark-as-ready operations with confirmation dialogs.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Tab component for ready orders with deduplication by orderId, includes search/filter controls and delete functionality to move orders back to Total Orders.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Dashboard summary cards component displaying total orders, weight, quantity, and customer orders metrics, filtered based on active tab with safe null handling and deduplication for ready orders.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Dialog component for marking RB orders as Ready by entering supplied quantity; supports single order partial supply (with order splitting) or bulk full-quantity supply for multiple orders.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays all Pending and ReturnFromHallmark orders with search, filtering by order type and karigar, and provides a button to mark RB orders as Ready via SuppliedQtyDialog.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Alert banner component that displays unmapped design codes (missing generic name or karigar name) with counts and navigation buttons to unmapped codes or master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Main application sidebar with navigation menu items (Dashboard, Ingest Orders, Unmapped Codes, Master Designs, Design Images, Tag Printing, Barcode Scanning, Data Reset) and branding footer.",
  "frontend/src/components/layout/DataResetDialog.tsx": "Confirmation dialog for deleting all active orders (Pending, Ready, ReturnFromHallmark statuses) with detailed warning about affected tabs.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal for editing design-to-karigar mappings with ability to select existing karigar or add new one; updates only affect Pending orders.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating order data, including operations for getting orders by status/karigar, saving orders, supplying orders, and bulk status updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes for UI components including gold accents for jewelry business branding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Barcode scanning page supporting both hardware scanners (via keyboard events) and camera-based QR scanning, with bulk order status updates and visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for viewing total orders, ready orders, hallmark orders, customer orders, and karigars, plus an unmapped orders section.",
  "frontend/src/pages/DesignImages.tsx": "Design image upload page supporting folder and ZIP file uploads, extracting design codes from filenames and batch-uploading images to the backend with progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Page for uploading and ingesting orders from Excel files, parsing them in batches, validating against design mappings, and saving to the backend with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page for a specific karigar showing their assigned orders with filtering by status, export to PDF/JPEG functionality, and a dialog for marking RB orders as ready with supplied quantity input.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading and managing the Master Design Excel file containing design-to-karigar mappings, with functionality to parse mappings, assign orders, and edit design assignments.",
  "frontend/src/pages/TagPrinting.tsx": "Page displaying ready orders grouped by design code with functionality to copy order numbers to clipboard for tag printing purposes.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page showing orders with incomplete design mappings (missing generic name or karigar), allowing inline editing to complete or reassign mappings with validation.",
  "frontend/src/utils/excelParser.ts": "Utility for parsing order Excel files using SheetJS, normalizing design codes to uppercase, validating required fields, and mapping order types (CO/RB/SO) with chunked processing to prevent UI blocking.",
  "frontend/src/utils/exportUtils.ts": "Provides utility functions to export orders to Excel (using SheetJS) and PDF (with embedded design images fetched from backend actor, grouped and sorted by design code).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color variables, font families (Inter, Playfair Display), container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata documenting the order management dashboard architecture, including features for Karigar mapping, design viewing, status tracking, RB order quantity splitting, ready tab deletion, and tag printing functionality."
}