{
  "backend/main.mo": "Main Motoko actor defining order management system with types (Order, OrderType, OrderStatus, DesignMapping, Karigar), persistent storage using Maps for orders/designs/karigars, and functions for saving orders, managing karigars, design mappings, and order assignments with status transitions.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: OrderTable row click behavior modification, eye icon removal, EditDesignModal save flow fix for design mapping updates, and PDF export fix for iPhone mobile browsers.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including routing, order management tabs, design image handling, Excel parsing, karigar management, and export utilities with specific implementation details for each file.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, sidebar) using oklch color space.",
  "frontend/index.html": "HTML entry point for the Jewellery Order Management System with viewport meta tag and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes (dashboard, ingest orders, unmapped codes, master designs, design images, tag printing, barcode scanning, karigar detail), QueryClient, ThemeProvider, and SidebarProvider layout with mobile-responsive header.",
  "frontend/src/components/dashboard/CustomerOrdersTab.tsx": "Tab component displaying Customer Order (CO) type orders by fetching data via useGetOrdersByType hook and rendering with OrderTable component.",
  "frontend/src/components/dashboard/DesignImageModal.tsx": "Modal dialog for displaying design images with zoom controls (0.5x to 3x), pan functionality via mouse/touch gestures, loading/error states, and design code header using useGetDesignImage hook.",
  "frontend/src/components/dashboard/HallmarkTab.tsx": "Tab component displaying Hallmark orders fetched via useGetHallmarkOrders hook and rendered with OrderTable component including date filter support.",
  "frontend/src/components/dashboard/KarigarsTab.tsx": "Displays a grid of cards showing karigars with their pending orders count and total weight, with navigation to individual karigar detail pages.",
  "frontend/src/components/dashboard/OrderTable.tsx": "Renders a table of orders with bulk selection, status updates, export functionality (Excel/PDF/JPEG), and design image modal integration.",
  "frontend/src/components/dashboard/ReadyTab.tsx": "Displays orders with 'Ready' status using the OrderTable component with date filtering enabled.",
  "frontend/src/components/dashboard/SummaryCards.tsx": "Shows four summary cards displaying total orders, total weight, total quantity, and customer orders count.",
  "frontend/src/components/dashboard/SuppliedQtyDialog.tsx": "Modal dialog for entering supplied quantity for RB orders before marking them as Ready, with validation against order quantity.",
  "frontend/src/components/dashboard/TotalOrdersTab.tsx": "Displays orders with Pending or ReturnFromHallmark status using OrderTable with bulk actions enabled.",
  "frontend/src/components/dashboard/UnmappedSection.tsx": "Alert banner showing unmapped design codes with missing generic or karigar names, with navigation to unmapped codes and master designs pages.",
  "frontend/src/components/layout/AppSidebar.tsx": "Collapsible sidebar navigation with menu items for dashboard, order ingestion, unmapped codes, master designs, design images, tag printing, and barcode scanning.",
  "frontend/src/components/masterdesigns/EditDesignModal.tsx": "Modal for editing design-to-karigar mappings with ability to select existing karigars or add new ones, updating both master data and pending orders.",
  "frontend/src/components/tagprinting/WebviewModal.tsx": "A modal dialog component that displays an embedded iframe for the MPN System with loading state, close button, and sandbox security attributes.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating order data, including filtering by status/type/karigar, saving/deleting orders, and managing design mappings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes with gold accents for a jewelry business UI and enhanced interaction states.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/BarcodeScanning.tsx": "Page component for scanning order barcodes using either hardware barcode scanners (via keyboard events) or camera-based QR scanning, with bulk status update functionality and visual feedback.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed interface showing summary cards, unmapped orders section, and tabs for total orders, ready orders, hallmark orders, customer orders, and karigars.",
  "frontend/src/pages/DesignImages.tsx": "Page for uploading design images via folder or ZIP file, extracting filenames as design codes, converting images to blobs, and storing them in the backend with batch processing and progress tracking.",
  "frontend/src/pages/IngestOrders.tsx": "Page for uploading and parsing order Excel files, validating design mappings exist in the backend, and batch-saving orders with progress tracking and error reporting.",
  "frontend/src/pages/KarigarDetail.tsx": "Detail page displaying all orders for a specific karigar with summary statistics (pending orders, total weight, total quantity) and PDF export functionality.",
  "frontend/src/pages/MasterDesigns.tsx": "Page for uploading master design Excel files to create design-to-karigar mappings, with inline editing capability to reassign designs and update pending orders accordingly.",
  "frontend/src/pages/TagPrinting.tsx": "Page for printing tags for ready orders via MPN system integration, requiring login through an embedded webview before processing orders with progress tracking.",
  "frontend/src/pages/UnmappedCodes.tsx": "Page displaying design codes missing generic names or karigar assignments, grouped by design code with inline editing to add missing mappings and update affected orders.",
  "frontend/src/utils/excelParser.ts": "Parses Excel files to extract order data and master design mappings using SheetJS, validating required fields and returning parsed data with errors in chunks to avoid UI blocking.",
  "frontend/src/utils/exportUtils.ts": "Exports orders to Excel and PDF formats, with PDF export grouping orders by design code, fetching design images as base64, and generating HTML-based PDFs sorted numerically.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography, container settings, font families, and animation plugins for the frontend UI.",
  "project_state.json": "Project state tracking three known issues: row selection including design code clicks, design mapping save failures, and PDF export broken on iPhone; defines four feature requests to fix these issues."
}