{
  "kind": "build_request",
  "title": "Fix Ready tab order visibility and export functionality",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix why order number 5038CO2600743-001 with Ready status is not appearing in the Ready tab dashboard. Verify the order status filtering logic in the backend query and frontend ReadyTab component to ensure all orders with Ready status are correctly retrieved and displayed.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "One order number 5038CO2600743-001 was marked ready but it's not being shown under the ready tab in dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Order 5038CO2600743-001 appears in the Ready tab when it has Ready status",
        "All other orders with Ready status continue to display correctly",
        "Backend query correctly filters and returns all Ready status orders",
        "Frontend ReadyTab correctly renders all Ready orders from the query"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the JPEG export functionality in OrderTable and KarigarDetail components. Ensure the export process correctly generates JPEG files from order data without errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Failed to export JPEG's and pdf pls fix it."
        ]
      },
      "acceptanceCriteria": [
        "JPEG export completes successfully without errors",
        "Generated JPEG files contain correct order information",
        "Export works from both OrderTable component and KarigarDetail page",
        "Loading states and error messages display appropriately during export"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the PDF export functionality in OrderTable and KarigarDetail components. Ensure the export process correctly generates PDF files from order data, including design images when available, without errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Failed to export JPEG's and pdf pls fix it."
        ]
      },
      "acceptanceCriteria": [
        "PDF export completes successfully without errors",
        "Generated PDF files contain correct order information and design images",
        "Export works from both OrderTable component and KarigarDetail page",
        "PDF formatting displays order data clearly with proper grouping by design code"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend order data structure or existing status values",
    "Preserve existing export utility functions in frontend/src/utils/exportUtils.ts",
    "Maintain compatibility with current OrderTable component usage across all dashboard tabs"
  ],
  "nonGoals": [
    "Redesigning the export UI or adding new export formats",
    "Modifying order status workflow or mark-as-ready functionality",
    "Changes to other dashboard tabs beyond fixing the Ready tab visibility issue"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}