{
  "kind": "build_request",
  "title": "Fix Ready Tab Display, Add RB Order Splitting, and Enhance PDF/JPEG Exports",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Ready tab to only display orders with status 'Ready'. Orders with status 'StatusChangedToReady' should not appear in the Ready tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Status changed to ready has been showing under ready tab."
        ]
      },
      "acceptanceCriteria": [
        "Ready tab displays only orders with exact status 'Ready'",
        "Orders with status 'StatusChangedToReady' do not appear in Ready tab",
        "All existing filters (order type, karigar, search, date range) continue to work correctly"
      ]
    },
    {
      "id": "REQ-2",
      "text": "For RB orders being marked as ready, prompt the user to enter a supplied quantity. Split the original order line into two separate entries: one with the pending quantity (original qty minus supplied qty) displayed in Total Orders tab, and one with the supplied quantity displayed in Ready Orders tab.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "For RB orders, ask for supplied qty: and split it as two lines, the order line with pending qty will be shown in total orders and supplied qty and the order line in ready orders."
        ]
      },
      "acceptanceCriteria": [
        "When marking an RB order as ready, a dialog prompts for supplied quantity",
        "Supplied quantity must be validated (cannot exceed original order quantity, must be greater than 0)",
        "After submission, the original order line is split into two entries with unique identifiers",
        "Pending quantity line (original qty - supplied qty) appears in Total Orders tab with status 'Pending'",
        "Supplied quantity line appears in Ready Orders tab with status 'Ready'",
        "Both split lines retain all other order properties (design code, karigar, order number, etc.)",
        "If supplied quantity equals original quantity, only the Ready line is created"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix PDF export functionality to work correctly on iPhone devices. Investigate and resolve current PDF generation failures specific to iOS Safari/mobile browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "PDF export fails and doesn't really work in iPhone."
        ]
      },
      "acceptanceCriteria": [
        "PDF export successfully generates and downloads on iPhone Safari",
        "PDF export works on iPhone Chrome and other iOS browsers",
        "Exported PDFs maintain proper formatting and data integrity on mobile devices",
        "Error handling provides clear feedback if PDF generation fails on any platform"
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the Karigar detail page, when exporting orders to PDF or JPEG, automatically include the associated design images in the exported files. Each order's design code should have its corresponding design image embedded in the export.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "From Karigar tab page whenever export is done through jpeg and pdf attach the design image in the PDF and jpeg when exported."
        ]
      },
      "acceptanceCriteria": [
        "PDF exports from Karigar detail page include design images for each order",
        "JPEG exports from Karigar detail page include design images for each order",
        "Design images are properly fetched and embedded based on order design codes",
        "Exports gracefully handle missing design images (display placeholder or skip)",
        "Image quality is maintained in exported files",
        "Export file size remains reasonable with embedded images"
      ]
    }
  ],
  "constraints": [
    "Maintain the single-actor backend architecture",
    "Do not modify the Internet Identity authentication hooks",
    "Preserve existing order filtering and tab functionality",
    "Ensure backward compatibility with existing order data"
  ],
  "nonGoals": [
    "Changing the overall UI design or layout",
    "Modifying authentication or user management",
    "Adding new order types beyond CO and RB",
    "Implementing real-time synchronization or notifications"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}