{
  "kind": "build_request",
  "title": "Fix order status filtering, tab-specific metrics, and column ordering",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify Total Orders tab to display only orders with status 'Pending'. When rows are selected and marked as ready, remove them from the Total Orders view immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Total orders should show orders with status pending and when rows are selected to update it as ready, the row gets removed from total orders and moved to ready"
        ]
      },
      "acceptanceCriteria": [
        "Total Orders tab filters orders to show only status 'Pending'",
        "After marking orders as ready, those orders disappear from Total Orders tab",
        "Orders appear in Ready tab after status update"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In Karigars tab, when viewing a specific karigar's pending orders and marking them as ready, remove those orders from the karigar's pending order list immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Same way from Karigar tabs, if selected and marked as ready it should remove from Karigar pending order list and move to ready"
        ]
      },
      "acceptanceCriteria": [
        "Karigar detail view shows only pending orders for that karigar",
        "After marking orders as ready, they are removed from karigar's pending list",
        "Orders appear in Ready tab after status update"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update SummaryCards component to calculate and display metrics (Total Orders count, Total Weight, Total Quantity, Customer Orders count) based on the currently active tab's filtered data, not all orders.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "The icons in dashboard ( Total orders. weight , qty, customer orders) should reflect true values as selected in current tab and keeps changing according to the tab"
        ]
      },
      "acceptanceCriteria": [
        "In Total Orders tab, summary cards show counts/totals for pending orders only",
        "In Ready tab, summary cards show counts/totals for ready orders only",
        "In Hallmark tab, summary cards show counts/totals for hallmark orders only",
        "In Customer Orders tab, summary cards show counts/totals for CO type orders only",
        "Metrics update immediately when switching tabs"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Modify Customer Orders tab to filter and display only orders where order type is 'CO', excluding all other order types.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Customer order tab should only show order type *CO* and not any other type"
        ]
      },
      "acceptanceCriteria": [
        "Customer Orders tab displays only orders with type 'CO'",
        "Orders with type 'RB' or other types are not visible in this tab"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Reorder all table columns across all dashboard tabs to display data in this exact sequence: Generic name, Karigar name, wt, size, qty, design code, remarks, order number, type, product.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Display the data in the dashboard as in this sequence. ( in all tabs ) - Generic name, Karigar name, wt , size , qty. design code, remarks, order number, type, product"
        ]
      },
      "acceptanceCriteria": [
        "OrderTable component displays columns in specified order",
        "Column order is consistent across Total Orders, Ready, Hallmark, Customer Orders, and Karigar detail tabs",
        "All existing columns remain functional with new ordering"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend order status logic or data models",
    "Maintain existing bulk selection and status update functionality",
    "Keep export functionality (Excel, PDF, JPEG) working with new column order"
  ],
  "nonGoals": [
    "Changing order status workflow or adding new statuses",
    "Modifying order ingestion or Excel parsing logic",
    "Adding new tabs or removing existing tabs"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}