{
  "kind": "build_request",
  "title": "Fix row selection behavior, design mapping save error, and mobile PDF export",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify OrderTable row click behavior: clicking anywhere on a row must select the row and highlight it with multi-select support, except when clicking on the Design Code text. When the Design Code text is clicked, it must open the Design Image Preview modal without selecting the row or toggling the checkbox.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Clicking anywhere on row → selects row",
          "Clicking on Design Code text must: ❌ NOT select the row ❌ NOT toggle checkbox ✅ Open Design Image Preview"
        ]
      },
      "acceptanceCriteria": [
        "Clicking on any part of a row except the Design Code text selects the row",
        "Selected rows are visually highlighted",
        "Multi-select works by clicking multiple rows",
        "Clicking the Design Code text opens the Design Image Preview modal",
        "Clicking the Design Code text does not select the row or toggle its checkbox"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the eye icon button from the right corner of each row in OrderTable. Image preview must only be triggered by clicking on the Design Code text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove eye icon from right corner",
          "Image preview must ONLY open via clicking Design Code"
        ]
      },
      "acceptanceCriteria": [
        "Eye icon button is completely removed from each row",
        "Design Image Preview can only be opened by clicking the Design Code text"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the 'Failed to update design mapping' error in EditDesignModal. When Save is clicked: Step 1 - Validate that Karigar selected is not empty. Step 2 - Update the Master Mapping Table with the new karigar assignment. Step 3 - Update only Pending orders with this design code to reflect the new karigar. Do NOT update orders with status 'Ready' or 'Hallmark'.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Failed to update design mapping",
          "Karigar selected must not be empty",
          "Update Master Mapping Table",
          "Update Pending Orders Only",
          "Do NOT update: Ready, Hallmark"
        ]
      },
      "acceptanceCriteria": [
        "Validation error is shown if no karigar is selected when saving",
        "Master design mapping is successfully updated in the backend",
        "All orders with 'Pending' status and matching design code are updated with the new karigar",
        "Orders with 'Ready' or 'Hallmark' status are not modified",
        "Success message confirms the update without errors"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix PDF export in KarigarDetail page so that exported PDFs open correctly on iPhone mobile browsers instead of failing to download or open.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "pdf exported in Karigar page doesn't open or gets downloaded in mobile app especially iPhone"
        ]
      },
      "acceptanceCriteria": [
        "PDF export from KarigarDetail page successfully opens on iPhone Safari",
        "PDF is properly rendered and viewable on mobile devices",
        "No download failures or blank screens occur on iPhone"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend authentication or Internet Identity integration",
    "Preserve existing OrderTable bulk selection and export functionality",
    "Maintain current PDF structure with design images and green headers"
  ],
  "nonGoals": [
    "Changing PDF visual styling or layout beyond mobile compatibility",
    "Modifying order status transitions or workflow logic",
    "Adding new design mapping features beyond the fix"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}