{
  "kind": "build_request",
  "title": "Implement Master Design auto-fill, Tag Printing enhancements, Hallmark workflow, and export improvements",
  "projectName": "Jewelry Order Management",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement automatic lookup of Design Code in Master Design data when orders are ingested or created. When a matching Design Code is found, automatically populate the Karigar Name and Generic Name fields in the Orders table with the values from Master Design.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Read Design Code from Orders",
          "Search same Design Code in Master Design",
          "Fetch: Karigar Name, Generic Name",
          "Auto-fill those fields in Orders table"
        ]
      },
      "acceptanceCriteria": [
        "When an order is saved, the system searches for the Design Code in Master Design mappings",
        "If a match is found, Karigar Name and Generic Name are automatically populated in the order",
        "The auto-fill occurs during order ingestion and any order creation operation",
        "Orders table contains the populated Karigar Name and Generic Name fields after processing"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Tag Printing page to display the Generic Name alongside each design group. Design groups should continue to show the Design Code, order numbers, and now also include the Generic Name for each group.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Update the Tag Printing page to display the Generic Name along with each design group"
        ]
      },
      "acceptanceCriteria": [
        "Tag Printing page shows Generic Name for each design group",
        "Generic Name is displayed in a clear, readable format within each design card",
        "Existing design code and order number display remains intact"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add date-wise filtering on the Tag Printing page based on the date when an order's status was changed to READY. Include a date range picker or date filter UI that allows users to filter design groups by when orders became READY.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add date-wise filtering based on the date when the status was changed to READY"
        ]
      },
      "acceptanceCriteria": [
        "Date filter UI is present on Tag Printing page",
        "Filter operates based on the timestamp when order status changed to READY",
        "Only design groups containing orders that match the date criteria are displayed",
        "Filter can be cleared to show all READY orders"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add functionality on the Tag Printing page to select an entire design group and change its status from READY to HALLMARK. Provide a checkbox or selection mechanism for each design group, and a bulk action button to update the selected groups. Once updated, those orders should move from the Ready tab to the Hallmark tab.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Provide an option to select an entire design group and change its status from READY to HALLMARK",
          "Once updated, those orders should move from the Ready tab to the Hallmark tab in the dashboard"
        ]
      },
      "acceptanceCriteria": [
        "Each design group on Tag Printing page has a selection checkbox",
        "Bulk action button changes status of all orders in selected design groups from READY to HALLMARK",
        "Orders with HALLMARK status appear in the Hallmark tab",
        "Orders no longer appear in the Ready tab after status change",
        "Confirmation dialog appears before applying the status change"
      ]
    },
    {
      "id": "REQ-5",
      "text": "In the Hallmark tab, add functionality to select multiple orders and change their status to Returned. Provide checkboxes for order selection and a button to mark selected orders as Returned. When marked as Returned, orders should move from the Hallmark tab back to the Total Orders tab with their status displaying as Returned.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In the Hallmark tab, add an option to select orders and change their status to Returned",
          "When marked as Returned, those orders should move from the Hallmark tab back to the Total Orders tab, and their status should display as Returned"
        ]
      },
      "acceptanceCriteria": [
        "Hallmark tab includes checkboxes for selecting individual orders",
        "Button to change selected orders' status to Returned is present",
        "Orders with Returned status appear in Total Orders tab",
        "Orders with Returned status no longer appear in Hallmark tab",
        "Status column displays 'Returned' for these orders",
        "Confirmation dialog appears before applying the status change"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add an export option on the Hallmark page that allows users to export the displayed orders to Excel format. The export button should be prominently placed and function similarly to existing export functionality on other tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "On the Hallmark page, add an export option"
        ]
      },
      "acceptanceCriteria": [
        "Export button is visible on the Hallmark tab",
        "Clicking export generates an Excel file with all Hallmark orders",
        "Excel file includes all relevant order columns (order number, design code, karigar name, generic name, weight, quantity, status, etc.)",
        "Export functionality works on both desktop and mobile devices"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Fix the PDF export functionality on the Karigar tab to ensure exported PDFs download properly on mobile devices instead of only displaying the message 'file exported'. Implement proper mobile download handling for iOS and Android devices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "On the Karigar tab, ensure exported PDFs download properly on mobile devices instead of only showing as 'file exported'"
        ]
      },
      "acceptanceCriteria": [
        "PDF export initiates a proper download on iOS devices",
        "PDF export initiates a proper download on Android devices",
        "Users can access the downloaded PDF file from their device's download folder",
        "Success message indicates successful download rather than generic 'file exported' message"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Increase the image size in exported PDF and JPEG files for the Karigar tab to improve clarity and readability. Design images should be larger and more detailed in the exported documents.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Increase image size in exported PDF and JPEG files for better clarity"
        ]
      },
      "acceptanceCriteria": [
        "Design images in PDF exports are larger than current implementation",
        "Design images in JPEG exports are larger than current implementation",
        "Images maintain aspect ratio and quality when enlarged",
        "Exported documents remain well-formatted with the larger images"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add export options for both Daily Orders and Total Orders in the Karigar tab. Provide separate export buttons or a dropdown menu to allow users to export either the daily orders or total orders for the selected karigar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also add export options for both Daily Orders and Total Orders in the Karigar tab"
        ]
      },
      "acceptanceCriteria": [
        "Export button or dropdown is present in the Karigar detail page",
        "User can select to export Daily Orders",
        "User can select to export Total Orders",
        "Each export generates a properly formatted Excel file with the corresponding data",
        "Export functionality works on both desktop and mobile devices"
      ]
    }
  ],
  "constraints": [
    "Do not disturb any existing functionality of the app",
    "Maintain the existing dashboard tab structure and navigation",
    "Preserve all current order status workflows and transitions",
    "Ensure tab movements (Ready → Hallmark → Total Orders) reflect accurately without breaking functionality",
    "Keep the single-actor backend architecture with all logic in main.mo"
  ],
  "nonGoals": [
    "Changing the existing Master Design data structure",
    "Modifying the order ingestion Excel format",
    "Altering the authentication or user management system",
    "Redesigning the UI layout or color scheme",
    "Adding new order types or statuses beyond Returned and Hallmark"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}