{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix row selection behavior, design mapping save error, and mobile PDF export",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Modify OrderTable row click behavior to select rows on click (except Design Code text) and open Design Image Preview modal only when Design Code text is clicked",
      "acceptanceCriteria": [
        "Clicking on any part of a row except the Design Code text selects the row",
        "Selected rows are visually highlighted",
        "Multi-select works by clicking multiple rows",
        "Clicking the Design Code text opens the Design Image Preview modal",
        "Clicking the Design Code text does not select the row or toggle its checkbox"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Modify row click handler to select rows when clicking anywhere except the Design Code text. Add event handler to Design Code text that stops event propagation and opens the Design Image Preview modal without toggling selection. Ensure multi-select functionality is preserved and selected rows are visually highlighted."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the eye icon button from OrderTable rows so Design Image Preview is only triggered by clicking Design Code text",
      "acceptanceCriteria": [
        "Eye icon button is completely removed from each row",
        "Design Image Preview can only be opened by clicking the Design Code text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Remove the eye icon button from the right corner of each row in the table. Ensure the Design Image Preview modal can only be opened by clicking the Design Code text as implemented in REQ-1."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix 'Failed to update design mapping' error in EditDesignModal by adding karigar validation and ensuring only Pending orders are updated when design mapping is saved",
      "acceptanceCriteria": [
        "Validation error is shown if no karigar is selected when saving",
        "Master design mapping is successfully updated in the backend",
        "All orders with 'Pending' status and matching design code are updated with the new karigar",
        "Orders with 'Ready' or 'Hallmark' status are not modified",
        "Success message confirms the update without errors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterdesigns/EditDesignModal.tsx",
          "operation": "modify",
          "description": "Add validation to ensure karigar is selected before saving. When Save is clicked: Step 1 - Validate that selectedKarigar or newKarigarName is not empty and show an error if validation fails. Step 2 - Call backend method saveDesignMapping to update the Master Mapping Table with the design code, generic name, and new karigar assignment. Step 3 - Call backend method reassignDesign to update only Pending orders with this design code to reflect the new karigar (backend will filter for Pending status only). Display success toast on completion and handle errors appropriately."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix PDF export in KarigarDetail page to open correctly on iPhone mobile browsers by using window.open instead of anchor tag download",
      "acceptanceCriteria": [
        "PDF export from KarigarDetail page successfully opens on iPhone Safari",
        "PDF is properly rendered and viewable on mobile devices",
        "No download failures or blank screens occur on iPhone"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/KarigarDetail.tsx",
          "operation": "modify",
          "description": "Modify the PDF export functionality to use window.open() with the blob URL instead of creating an anchor element with download attribute. This ensures PDFs open correctly in iPhone mobile browsers (Safari) rather than failing to download. After generating the PDF blob, call window.open(blobUrl, '_blank') to open the PDF in a new tab where it can be viewed and optionally saved by the user."
        },
        {
          "path": "frontend/src/utils/exportUtils.ts",
          "operation": "modify",
          "description": "Update the exportToPDF function to return the blob URL instead of automatically triggering download via anchor element. Remove the anchor.download logic and let the calling component (KarigarDetail) handle opening the PDF with window.open(). Ensure the PDF generation logic (HTML conversion, design image embedding, green headers) remains unchanged."
        }
      ]
    }
  ]
}