{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix order status filtering, tab-specific metrics, and column ordering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Filter Total Orders tab to show only Pending status orders and remove them immediately when marked as ready",
      "acceptanceCriteria": [
        "Total Orders tab filters orders to show only status 'Pending'",
        "After marking orders as ready, those orders disappear from Total Orders tab",
        "Orders appear in Ready tab after status update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Update the component to filter orders by status 'Pending' only (exclude 'ReturnFromHallmark'). Ensure the useOrders hook includes statusFilter parameter set to OrderStatus.Pending. The component currently fetches pending and return-from-hallmark orders, but should only display Pending status orders."
        },
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Ensure that after bulk status update to Ready, the React Query cache is properly invalidated so the Total Orders tab reflects the removal of those orders immediately. Verify the mutation's onSuccess callback triggers the appropriate query invalidation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove orders from karigar's pending list immediately when marked as ready in Karigars tab detail view",
      "acceptanceCriteria": [
        "Karigar detail view shows only pending orders for that karigar",
        "After marking orders as ready, they are removed from karigar's pending list",
        "Orders appear in Ready tab after status update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/KarigarDetail.tsx",
          "operation": "modify",
          "description": "Update the karigar detail page to filter orders by Pending status only. Ensure the query hook properly filters by karigarName and status=Pending. Verify that after marking orders as ready, the query is invalidated and the filtered list updates to remove those orders from the view."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update SummaryCards to calculate metrics based on currently active tab's filtered data instead of all orders",
      "acceptanceCriteria": [
        "In Total Orders tab, summary cards show counts/totals for pending orders only",
        "In Ready tab, summary cards show counts/totals for ready orders only",
        "In Hallmark tab, summary cards show counts/totals for hallmark orders only",
        "In Customer Orders tab, summary cards show counts/totals for CO type orders only",
        "Metrics update immediately when switching tabs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/SummaryCards.tsx",
          "operation": "modify",
          "description": "Refactor SummaryCards to accept filtered orders as a prop instead of fetching all orders internally. Calculate Total Orders count, Total Weight, Total Quantity, and Customer Orders count based on the provided filtered data. Update the component interface to receive orders array and compute metrics client-side."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update Dashboard to pass tab-specific filtered orders to SummaryCards component. For each tab (Total Orders, Ready, Hallmark, Customer Orders, Karigars), provide the appropriate filtered dataset to SummaryCards so metrics reflect only the visible orders in the active tab. Ensure metrics update when switching between tabs."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Filter Customer Orders tab to display only orders with type 'CO'",
      "acceptanceCriteria": [
        "Customer Orders tab displays only orders with type 'CO'",
        "Orders with type 'RB' or other types are not visible in this tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/CustomerOrdersTab.tsx",
          "operation": "modify",
          "description": "Update the component to use the useOrders hook with typeFilter parameter set to OrderType.CO. This ensures only CO type orders are fetched and displayed. The current implementation may not be applying the type filter correctly."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Reorder table columns to display: Generic name, Karigar name, wt, size, qty, design code, remarks, order number, type, product",
      "acceptanceCriteria": [
        "OrderTable component displays columns in specified order",
        "Column order is consistent across Total Orders, Ready, Hallmark, Customer Orders, and Karigar detail tabs",
        "All existing columns remain functional with new ordering"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Reorder the table column definitions to match the exact sequence: Generic name, Karigar name, wt (weight), size, qty (quantity), design code, remarks, order number, type, product. Update the TableHeader and TableRow rendering logic to reflect this new column order. Ensure all column functionality (sorting, filtering, rendering) remains intact with the new ordering. Verify export functionality (Excel, PDF, JPEG) respects the new column order."
        }
      ]
    }
  ]
}