{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix PDF export design images and restore colorful formatting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Embed actual design images in PDF export by fetching uploaded images via design code and converting them to base64 format for PDF embedding",
      "acceptanceCriteria": [
        "PDF export displays actual design images for all design codes that have images uploaded",
        "Design code CHTMN40009 shows the gold chain image in the PDF export",
        "If a design image is truly missing, show 'Image Not Available' text instead of placeholder brackets"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/exportUtils.ts",
          "operation": "modify",
          "description": "Modify the exportToPDF function to fetch design images using the getDesignImage backend method. For each unique design code in the order list, call getDesignImage and convert the returned ExternalBlob to base64 using getBytes(). Embed the base64 image data in the PDF HTML structure where design images are currently shown as placeholder text '[Design Image: ...]'. If getDesignImage returns null, display 'Image Not Available' text. Ensure images are sized appropriately for PDF layout (e.g., max-width for embedding)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore colorful PDF export structure with green header rows for each design group and numeric sorting of design codes from lower to higher",
      "acceptanceCriteria": [
        "Each design group in the PDF has a green header row with the design code",
        "Orders are sorted by design code numerically (lower to higher)",
        "Visual formatting matches the previous colorful structure with clear separation between design groups",
        "Table headers maintain green background color (#4CAF50 or similar)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/exportUtils.ts",
          "operation": "modify",
          "description": "Modify the exportToPDF function to restore the colorful formatting structure. Sort orders by design code numerically (parse numeric portion or use natural sort) before grouping. For each design group, add a green header row (background-color: #4CAF50 or similar) displaying the design code prominently. Apply green background (#4CAF50) to table column headers. Add visual separation between design groups using borders or spacing. Ensure the PDF structure matches the previous version's colorful layout with distinct design sections."
        }
      ]
    }
  ]
}