{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Excel parsing to normalize design codes for proper matching",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Normalize design codes in excelParser.ts by trimming whitespace and converting to uppercase",
      "acceptanceCriteria": [
        "Design codes from uploaded Excel files are trimmed of leading/trailing whitespace",
        "Design codes are converted to uppercase for matching (e.g., 'chtmn40952' becomes 'CHTMN40952')",
        "Normalization applies to both Master Design Excel parsing and order Excel parsing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/excelParser.ts",
          "operation": "modify",
          "description": "Add a utility function normalizeDesignCode that trims whitespace and converts to uppercase. Update parseOrderExcel to normalize design codes read from order Excel files. Update parseMasterDesignExcel to normalize design codes read from Column A before creating MappingRecords. Ensure normalization is applied consistently in both parsing functions so that design codes from orders match design codes from master designs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Master Design Excel parsing to correctly identify columns A, B, C as DESIGN CODE, Generic Name, and Karigar Name",
      "acceptanceCriteria": [
        "Column A values are read as design codes",
        "Column B values are read as generic names",
        "Column C values are read as karigar names",
        "Parser validates that these columns exist in the uploaded Excel file"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/excelParser.ts",
          "operation": "modify",
          "description": "Update parseMasterDesignExcel function to explicitly read Column A as designCode, Column B as genericName, and Column C as karigarName (instead of relying on column header detection). Add validation to ensure all three columns exist and contain data. Skip empty rows. Return error messages if required columns are missing or invalid."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Automatically update existing orders with matching design codes when Master Design Excel is uploaded",
      "acceptanceCriteria": [
        "After Master Design Excel upload, all orders with matching design codes are updated with Generic Name and Karigar Name",
        "Orders that were previously unmapped are removed from the unmapped section if they now have matches",
        "Update happens immediately without requiring manual action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MasterDesigns.tsx",
          "operation": "modify",
          "description": "After successfully uploading the Master Design Excel and saving design mappings via uploadDesignMapping mutation, add a call to backend capability assignOrdersToKarigar to automatically apply the newly uploaded mappings to all existing orders with matching design codes. Pass the newly parsed mappings array to trigger the backend update. Ensure this happens before showing the success toast so that orders are immediately updated and the unmapped count decreases."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the uploadDesignMapping mutation to invalidate both designMappings and orders queries after successful upload, ensuring that the dashboard and unmapped section reflect the newly applied mappings immediately. Add invalidateQueries calls for both 'orders' and 'designMappings' query keys in the onSuccess callback."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display confirmation message showing mapping success count after Master Design Excel upload",
      "acceptanceCriteria": [
        "After upload, display a success message with count of mapped design codes",
        "Show count of orders that were updated with new mappings",
        "If any design codes failed to map, display warning with details"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MasterDesigns.tsx",
          "operation": "modify",
          "description": "After the Master Design Excel upload completes, fetch the updated orders using getOrdersWithMappings backend capability to count how many orders now have mappings. Calculate the difference between unmapped orders before and after upload. Display a success toast showing the number of design codes uploaded and the number of orders that were successfully mapped. If any design codes from the Excel are already in the system, show a count of updated mappings versus new mappings."
        }
      ]
    }
  ]
}