{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Karigar and generic name display in dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Karigar names (karigarName field) display correctly in all dashboard tabs when rendering order rows in OrderTable component",
      "acceptanceCriteria": [
        "Karigar names appear in all order rows across all dashboard tabs",
        "Karigar names match the values stored in the order records",
        "No null or undefined values appear where Karigar names should display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Review and fix how karigarName field is accessed and displayed in table cells. Ensure the column definition properly reads order.karigarName from each order object and handles undefined/null values with fallback display text. Add defensive checks to prevent display of undefined/null as string literals."
        },
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with karigarName field intact. Review any data transformations or filtering logic to ensure karigarName is preserved when orders are filtered by status or type."
        },
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with karigarName field intact. Review filtering logic for ready orders to ensure karigarName is preserved in filtered results."
        },
        {
          "path": "frontend/src/components/dashboard/HallmarkTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with karigarName field intact. Review filtering logic (by order type, karigar name, order number, date range) to ensure karigarName is preserved throughout all filter operations."
        },
        {
          "path": "frontend/src/components/dashboard/CustomerOrdersTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with karigarName field intact. Review filtering logic for CO-type pending orders to ensure karigarName is preserved when applying status and type filters."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure generic names (genericName field) display correctly in all dashboard tabs when rendering order rows in OrderTable component",
      "acceptanceCriteria": [
        "Generic names appear in all order rows across all dashboard tabs",
        "Generic names match the values stored in the order records",
        "No null or undefined values appear where generic names should display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Review and fix how genericName field is accessed and displayed in table cells. Ensure the column definition properly reads order.genericName from each order object and handles undefined/null values with fallback display text. Add defensive checks to prevent display of undefined/null as string literals."
        },
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with genericName field intact. Review any data transformations or filtering logic to ensure genericName is preserved when orders are filtered."
        },
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with genericName field intact. Review filtering logic to ensure genericName is preserved in filtered results."
        },
        {
          "path": "frontend/src/components/dashboard/HallmarkTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with genericName field intact. Review all filtering logic to ensure genericName is preserved throughout filter operations."
        },
        {
          "path": "frontend/src/components/dashboard/CustomerOrdersTab.tsx",
          "operation": "modify",
          "description": "Verify that orders passed to OrderTable component include complete order objects with genericName field intact. Review filtering logic to ensure genericName is preserved."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify that order filtering logic in TotalOrdersTab and ReadyTab preserves karigarName and genericName fields when filtering by status, order type, or karigar selection",
      "acceptanceCriteria": [
        "Filtered order arrays contain complete order objects with all name fields",
        "No data transformation during filtering removes or nullifies karigarName or genericName",
        "Orders displayed after applying filters show correct names"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Review useMemo hooks and filter operations that process orders array. Ensure all filter operations use array methods that preserve complete order objects (e.g., .filter() without destructuring or field omission). Verify that no intermediate transformations accidentally strip out karigarName or genericName fields. Add console logging during development to verify filtered orders retain all fields."
        },
        {
          "path": "frontend/src/components/dashboard/ReadyTab.tsx",
          "operation": "modify",
          "description": "Review useMemo hooks and filter operations that process orders array. Ensure all filter operations use array methods that preserve complete order objects. Verify that filtering by order type, karigar name, order number, and date range all maintain karigarName and genericName fields in the filtered results."
        },
        {
          "path": "frontend/src/components/dashboard/HallmarkTab.tsx",
          "operation": "modify",
          "description": "Review useMemo hooks and filter operations that process orders array. Ensure all filter operations preserve complete order objects with all name fields intact across multiple filter criteria."
        },
        {
          "path": "frontend/src/components/dashboard/CustomerOrdersTab.tsx",
          "operation": "modify",
          "description": "Review useMemo hooks and filter operations that process orders array. Ensure filtering logic preserves complete order objects with karigarName and genericName fields."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Verify that RB order splitting logic (when marking orders as ready with supplied quantities) preserves karigarName and genericName in both original and newly created order records",
      "acceptanceCriteria": [
        "When an RB order is split, both the updated original order and any new order records retain karigarName values",
        "When an RB order is split, both the updated original order and any new order records retain genericName values",
        "Split orders display names correctly in the dashboard after the split operation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/SuppliedQtyDialog.tsx",
          "operation": "modify",
          "description": "Review the logic that handles RB order splitting when supplied quantity is less than total quantity. Ensure that when creating data for the supplyOrder backend call, the frontend passes or expects the backend to preserve karigarName and genericName fields. If the frontend constructs any new order objects locally before syncing, explicitly copy karigarName and genericName from the original order to any split order representation. Add validation to verify these fields are present before submitting."
        },
        {
          "path": "frontend/src/components/dashboard/TotalOrdersTab.tsx",
          "operation": "modify",
          "description": "Review the flow when SuppliedQtyDialog is triggered for RB orders. Ensure that after the supply operation completes and queries are invalidated, the refetched orders include karigarName and genericName. Verify that no local state transformations strip these fields between backend response and component display."
        },
        {
          "path": "frontend/src/components/dashboard/OrderTable.tsx",
          "operation": "modify",
          "description": "Review the markAsReady flow that triggers SuppliedQtyDialog for RB orders. Ensure that after the supply mutation succeeds and orders are refetched, the table re-renders with complete order objects including karigarName and genericName. Add defensive checks in the rendering logic to handle cases where these fields might be temporarily undefined during refetch."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the supplyOrder mutation hook to ensure it properly invalidates order queries after RB order splitting. Verify that when queries are invalidated and refetched, the backend interface correctly maps karigarName and genericName fields from the backend Order type to the frontend. Ensure no type transformations or mapping logic accidentally omits these optional fields."
        }
      ]
    }
  ]
}